["An Instant New York Times Bestseller A Goodreads Most Anticipated Book \"Suspenseful, sexy, and with incredibly entertaining storytelling, the first in Yarros' Empyrean series will delight fans of romantic, adventure-filled fantasy.\" —Booklist, starred review \"Fourth Wing will have your heart pounding from beginning to end... A fantasy like you've never read before.\" ―#1 New York Times bestselling author Jennifer L. Armentrout Enter the brutal and elite world of a war college for dragon riders from New York Times bestselling author Rebecca Yarros Twenty-year-old Violet Sorrengail was supposed to enter the Scribe Quadrant, living a quiet life among books and history. Now, the commanding general—also known as her tough-as-talons mother—has ordered Violet to join the hundreds of candidates striving to become the elite of Navarre: dragon riders. But when you’re smaller than everyone else and your body is brittle, death is only a heartbeat away...because dragons don’t bond to “fragile” humans. They incinerate them. With fewer dragons willing to bond than cadets, most would kill Violet to better their own chances of success. The rest would kill her just for being her mother’s daughter—like Xaden Riorson, the most powerful and ruthless wingleader in the Riders Quadrant. She’ll need every edge her wits can give her just to see the next sunrise. Yet, with every day that passes, the war outside grows more deadly, the kingdom's protective wards are failing, and the death toll continues to rise. Even worse, Violet begins to suspect leadership is hiding a terrible secret. Friends, enemies, lovers. Everyone at Basgiath War College has an agenda—because once you enter, there are only two ways out: graduate or die. The Empyrean series is best enjoyed in order. Reading Order: Book #1 Fourth Wing Book #2 Iron Flame", "INSTANT #1 NEW YORK TIMES BESTSELLER! “The beach-read master hooks us again.\"—People Named a Most Anticipated Book of 2023 by BuzzFeed ∙ Paste Magazine ∙ Elle ∙ Southern Living ∙ SheReads ∙ Culturess ∙ Medium ∙ Her Campus ∙ Readers Digest ∙ Zibby Mag and more! A couple who broke up months ago pretend to still be together for their annual weeklong vacation with their best friends in this glittering and wise new novel from #1 New York Times bestselling author Emily Henry. Harriet and Wyn have been the perfect couple since they met in college—they go together like salt and pepper, honey and tea, lobster and rolls. Except, now—for reasons they’re still not discussing—they don’t. They broke up five months ago. And still haven’t told their best friends. Which is how they find themselves sharing a bedroom at the Maine cottage that has been their friend group’s yearly getaway for the last decade. Their annual respite from the world, where for one vibrant, blissful week they leave behind their daily lives; have copious amounts of cheese, wine, and seafood; and soak up the salty coastal air with the people who understand them most. Only this year, Harriet and Wyn are lying through their teeth while trying not to notice how desperately they still want each other. Because the cottage is for sale and this is the last week they’ll all have together in this place. They can’t stand to break their friends’ hearts, and so they’ll play their parts. Harriet will be the driven surgical resident who never starts a fight, and Wyn will be the laid-back charmer who never lets the cracks show. It’s a flawless plan (if you look at it from a great distance and through a pair of sunscreen-smeared sunglasses). After years of being in love, how hard can it be to fake it for one week…in front of those who know you best?", "INSTANT NEW YORK TIMES BESTSELLER • A REESE'S BOOK CLUB PICK “Hard to put down, harder to forget.” — Stephen King, #1 New York Times bestselling author White lies. Dark humor. Deadly consequences… Bestselling sensation Juniper Song is not who she says she is, she didn’t write the book she claims she wrote, and she is most certainly not Asian American—in this chilling and hilariously cutting novel from R.F. Kuang, the #1 New York Times bestselling author of Babel. Authors June Hayward and Athena Liu were supposed to be twin rising stars. But Athena’s a literary darling. June Hayward is literally nobody. Who wants stories about basic white girls, June thinks. So when June witnesses Athena’s death in a freak accident, she acts on impulse: she steals Athena’s just-finished masterpiece, an experimental novel about the unsung contributions of Chinese laborers during World War I. So what if June edits Athena’s novel and sends it to her agent as her own work? So what if she lets her new publisher rebrand her as Juniper Song—complete with an ambiguously ethnic author photo? Doesn’t this piece of history deserve to be told, whoever the teller? That’s what June claims, and the New York Times bestseller list seems to agree. But June can’t get away from Athena’s shadow, and emerging evidence threatens to bring June’s (stolen) success down around her. As June races to protect her secret, she discovers exactly how far she will go to keep what she thinks she deserves. With its totally immersive first-person voice, Yellowface grapples with questions of diversity, racism, and cultural appropriation, as well as the terrifying alienation of social media. R.F. Kuang’s novel is timely, razor-sharp, and eminently readable.", "A runaway queen. A reluctant prince. And a quest that may destroy them both. Eight years have passed since the Battle of the Serpent. But in the icy north, Lady Nore of the Court of Teeth, has reclaimed the Ice Needle Citadel. There she is using an ancient relic to create monsters of stick and snow who will do her bidding and exact her revenge. Suren, child queen of the Court of Teeth, and the one person with power over her mother, fled to the human world, where she lives feral in the woods. Lonely, and still haunted by the merciless torments she endured in the Court of Teeth, she bides her time by releasing mortals from foolish bargains. She believes herself forgotten until the storm hag Bogdana chases her through the night streets. Suren is saved by none other than Prince Oak, heir to Elfhame, to whom she was once promised in marriage and who she has resented for years. Now seventeen, Oak is charming, beautiful and manipulative. He's on a mission that will lead him into the north, and he wants Suren's help. But if she agrees, it will mean guarding her heart against the boy she once knew and a prince she cannot trust, as well as confronting all the horrors she thought she had left behind. The spellbinding new fantasy from the Queen of Faerie Holly Black, author of the Folk of the Air series.", "An Indie Next and Library Reads Pick! Rival physicists collide in a vortex of academic feuds and fake dating shenanigans in this delightfully STEMinist romcom from the New York Times bestselling author of The Love Hypothesis and Love on the Brain. The many lives of theoretical physicist Elsie Hannaway have finally caught up with her. By day, she’s an adjunct professor, toiling away at grading labs and teaching thermodynamics in the hopes of landing tenure. By other day, Elsie makes up for her non-existent paycheck by offering her services as a fake girlfriend, tapping into her expertly honed people-pleasing skills to embody whichever version of herself the client needs. Honestly, it’s a pretty sweet gig—until her carefully constructed Elsie-verse comes crashing down. Because Jack Smith, the annoyingly attractive and arrogant older brother of her favorite client, turns out to be the cold-hearted experimental physicist who ruined her mentor’s career and undermined the reputation of theorists everywhere. And he’s the same Jack Smith who rules over the physics department at MIT, standing right between Elsie and her dream job. Elsie is prepared for an all-out war of scholarly sabotage but…those long, penetrating looks? Not having to be anything other than her true self when she’s with him? Will falling into an experimentalist’s orbit finally tempt her to put her most guarded theories on love into practice?", "Two villains, one girl, and a deadly battle for happily ever after. Evangeline Fox ventured to the Magnificent North in search of her happy ending, and it seems as if she has it. She's married to a handsome prince and lives in a legendary castle. But Evangeline has no idea of the devastating price she's paid for this fairytale. She doesn't know what she has lost, and her husband is determined to make sure she never finds out . . . but first he must kill Jacks, the Prince of Hearts. Blood will be shed, hearts will be stolen, and true love will be put to the test in A Curse for True Love, the breathlessly anticipated conclusion to the Once Upon A Broken Heart trilogy.", "#1 New York Times Bestseller From the author of Shadow and Bone, now a hit NETFLIX series “Readers will be wowed.\" –Publishers Weekly (starred review) Wealth. Power. Murder. Magic. The Ivy League is going straight to hell in the sequel to the smash New York Times bestseller Ninth House from #1 bestselling author Leigh Bardugo. \"Bardugo’s imaginative reach is brilliant.\" –Stephen King A MOST ANTICIPATED BOOK OF 2023 by The New York Times, The Week, Kirkus Reviews, PopSugar, Distractify, Booklist Queen, The Nerd Daily, and more!! Find a gateway to the underworld. Steal a soul out of hell. A simple plan, except people who make this particular journey rarely come back. But Galaxy “Alex” Stern is determined to break Darlington out of purgatory—even if it costs her a future at Lethe and at Yale. Forbidden from attempting a rescue, Alex and Dawes can’t call on the Ninth House for help, so they assemble a team of dubious allies to save the gentleman of Lethe. Together, they will have to navigate a maze of arcane texts and bizarre artifacts to uncover the societies’ most closely guarded secrets, and break every rule doing it. But when faculty members begin to die off, Alex knows these aren’t just accidents. Something deadly is at work in New Haven, and if she is going to survive, she’ll have to reckon with the monsters of her past and a darkness built into the university’s very walls. Thick with history and packed with Bardugo’s signature twists, Hell Bent brings to life an intricate world full of magic, violence, and all too real monsters.", "\"#1 New York Times Bestselling author Brandon Sanderson brings us deeper into the Cosmere universe with a rollicking, riveting tale that will appeal to fans of The Princess Bride. The only life Tress has known on her island home in an emerald-green ocean has been a simple one, with the simple pleasures of collecting cups brought by sailors from faraway lands and listening to stories told by her friend Charlie. But when his father takes him on a voyage to find a bride and disaster strikes, Tress must stow away on a ship and seek the Sorceress of the deadly Midnight Sea. Amid the spore oceans where pirates abound, can Tress leave her simple life behind and make her own place sailing a sea where a single drop of water can mean instant death? Other Tor books by Brandon Sanderson The Cosmere The Stormlight Archive The Way of Kings Words of Radiance Edgedancer (Novella) Oathbringer Dawnshard (Novella) Rhythm of War Mistborn: The Original Trilogy Mistborn The Well of Ascension The Hero of Ages Mistborn: The Wax and Wayne series Alloy of Law Shadows of Self Bands of Mourning The Lost Metal Collection Arcanum Unbounded Other Cosmere novels Elantris Warbreaker Tress and the Emerald Sea (forthcoming) Yumi and the Nightmare Painter (forthcoming) The Sunlit Man (forthcoming) The Alcatraz vs. the Evil Librarians series Alcatraz vs. the Evil Librarians The Scrivener's Bones The Knights of Crystallia The Shattered Lens The Dark Talent Bastille vs. the Evil Librarians (co-authored with Janci Patterson) The Rithmatist series The Rithmatist Other novels Legion: The Many Lives of Stephen Leeds The Frugal Wizard's Handbook for Surviving Medieval England (forthcoming) Other books by Brandon Sanderson The Reckoners Steelheart Firefight Calamity Skyward Skyward Starsight Cytonic\"--", "NATIONAL BESTSELLER • A curmudgeonly professor journeys to a small town in the far north to study faerie folklore and discovers dark fae magic, friendship, and love in the start of a heartwarming and enchanting new fantasy series. “A darkly gorgeous fantasy that sparkles with snow and magic.”—Sangu Mandanna, author of The Very Secret Society of Irregular Witches Cambridge professor Emily Wilde is good at many things: She is the foremost expert on the study of faeries. She is a genius scholar and a meticulous researcher who is writing the world’s first encyclopaedia of faerie lore. But Emily Wilde is not good at people. She could never make small talk at a party—or even get invited to one. And she prefers the company of her books, her dog, Shadow, and the Fair Folk to other people. So when she arrives in the hardscrabble village of Hrafnsvik, Emily has no intention of befriending the gruff townsfolk. Nor does she care to spend time with another new arrival: her dashing and insufferably handsome academic rival Wendell Bambleby, who manages to charm the townsfolk, muddle Emily’s research, and utterly confound and frustrate her. But as Emily gets closer and closer to uncovering the secrets of the Hidden Ones—the most elusive of all faeries—lurking in the shadowy forest outside the town, she also finds herself on the trail of another mystery: Who is Wendell Bambleby, and what does he really want? To find the answer, she’ll have to unlock the greatest mystery of all—her own heart.", "NEW YORK TIMES BESTSELLER • OPRAH’S BOOK CLUB PICK • From the author of Dear Edward comes a “powerfully affecting” (People) family story that asks: Can love make a broken person whole? “Another tender tearjerker . . . Napolitano chronicles life’s highs and lows with aching precision.”—The Washington Post William Waters grew up in a house silenced by tragedy, where his parents could hardly bear to look at him, much less love him—so when he meets the spirited and ambitious Julia Padavano in his freshman year of college, it’s as if the world has lit up around him. With Julia comes her family, as she and her three sisters are inseparable: Sylvie, the family’s dreamer, is happiest with her nose in a book; Cecelia is a free-spirited artist; and Emeline patiently takes care of them all. With the Padavanos, William experiences a newfound contentment; every moment in their house is filled with loving chaos. But then darkness from William’s past surfaces, jeopardizing not only Julia’s carefully orchestrated plans for their future, but the sisters’ unshakeable devotion to one another. The result is a catastrophic family rift that changes their lives for generations. Will the loyalty that once rooted them be strong enough to draw them back together when it matters most? An exquisite homage to Louisa May Alcott’s timeless classic, Little Women, Hello Beautiful is a profoundly moving portrait of what is possible when we choose to love someone not in spite of who they are, but because of it.", "Following up her instant New York Times bestseller, A Flicker in the Dark, Stacy Willingham delivers a totally gripping thriller about a desperate mother with a troubled past in All the Dangerous Things. One year ago, Isabelle Drake's life changed forever: her toddler son, Mason, was taken out of his crib in the middle of the night while she and her husband were asleep in the next room. With little evidence and few leads for the police to chase, the case quickly went cold. However, Isabelle cannot rest until Mason is returned to her—literally. Except for the occasional catnap or small blackout where she loses track of time, she hasn’t slept in a year. Isabelle's entire existence now revolves around finding him, but she knows she can’t go on this way forever. In hopes of jarring loose a new witness or buried clue, she agrees to be interviewed by a true-crime podcaster—but his interest in Isabelle's past makes her nervous. His incessant questioning paired with her severe insomnia has brought up uncomfortable memories from her own childhood, making Isabelle start to doubt her recollection of the night of Mason’s disappearance, as well as second-guess who she can trust... including herself. But she is determined to figure out the truth no matter where it leads.", "A novel of terrible first impressions, hilarious second chances, and the joy in finding your perfect match from \"a true talent\" (Emily Henry, #1 New York Times bestselling author). Dr. Briana Ortiz’s life is seriously flatlining. Her divorce is just about finalized, her brother’s running out of time to find a kidney donor, and that promotion she wants? Oh, that’s probably going to the new man-doctor who’s already registering eighty-friggin’-seven on Briana’s “pain in my ass” scale. But just when all systems are set to hate, Dr. Jacob Maddox completely flips the game . . . by sending Briana a letter. And it’s a really good letter. Like the kind that proves that Jacob isn’t actually Satan. Worse, he might be this fantastically funny and subversively likeable guy who’s terrible at first impressions. Because suddenly he and Bri are exchanging letters, sharing lunch dates in her “sob closet,” and discussing the merits of freakishly tiny horses. But when Jacob decides to give Briana the best gift imaginable—a kidney for her brother—she wonders just how she can resist this quietly sexy new doctor . . . especially when he calls in a favor she can’t refuse. “Abby Jimenez’s words…sprinkle humor and warmth all over my life.” –Ali Hazelwood, New York Times bestselling author of The Love Hypothesis", "\"A thrilling, transportative adventure that is everything promised–Chakraborty's storytelling is fantasy at its best.\" -- R.F. Kuang, #1 New York Times bestselling author of Babel and The Poppy War \"An exhilarating, propulsive adventure, stitched from the threads of real history, Amina’s adventures are the reason to read fantasy.\" -- Ava Reid, internationally bestselling author of Juniper & Thorn Shannon Chakraborty, the bestselling author of The City of Brass, spins a new trilogy of magic and mayhem on the high seas in this tale of pirates and sorcerers, forbidden artifacts and ancient mysteries, in one woman’s determined quest to seize a final chance at glory—and write her own legend. Amina al-Sirafi should be content. After a storied and scandalous career as one of the Indian Ocean’s most notorious pirates, she’s survived backstabbing rogues, vengeful merchant princes, several husbands, and one actual demon to retire peacefully with her family to a life of piety, motherhood, and absolutely nothing that hints of the supernatural. But when she’s tracked down by the obscenely wealthy mother of a former crewman, she’s offered a job no bandit could refuse: retrieve her comrade’s kidnapped daughter for a kingly sum. The chance to have one last adventure with her crew, do right by an old friend, and win a fortune that will secure her family’s future forever? It seems like such an obvious choice that it must be God’s will. Yet the deeper Amina dives, the more it becomes alarmingly clear there’s more to this job, and the girl’s disappearance, than she was led to believe. For there’s always risk in wanting to become a legend, to seize one last chance at glory, to savor just a bit more power…and the price might be your very soul.", "When two young rival journalists find love through a magical connection, they must face the depths of hell, in a war among gods, to seal their fate forever. After centuries of sleep, the gods are warring again. But eighteen-year-old Iris Winnow just wants to hold her family together. Her mother is suffering from addiction and her brother is missing from the front lines. Her best bet is to win the columnist promotion at the Oath Gazette. To combat her worries, Iris writes letters to her brother and slips them beneath her wardrobe door, where they vanish—into the hands of Roman Kitt, her cold and handsome rival at the paper. When he anonymously writes Iris back, the two of them forge a connection that will follow Iris all the way to the front lines of battle: for her brother, the fate of mankind, and love. Shadow and Bone meets Lore in Rebecca Ross's Divine Rivals, an epic enemies-to-lovers fantasy novel filled with hope and heartbreak, and the unparalleled power of love.", "AN INSTANT NEW YORK TIMES BESTSELLER \"Wildly entertaining.\"-The New York Times \"Ingenious.\"-The Washington Post New York Times bestselling author Grady Hendrix takes on the haunted house in a thrilling new novel that explores the way your past—and your family—can haunt you like nothing else. When Louise finds out her parents have died, she dreads going home. She doesn’t want to leave her daughter with her ex and fly to Charleston. She doesn’t want to deal with her family home, stuffed to the rafters with the remnants of her father’s academic career and her mother’s lifelong obsession with puppets and dolls. She doesn’t want to learn how to live without the two people who knew and loved her best in the world. Most of all, she doesn’t want to deal with her brother, Mark, who never left their hometown, gets fired from one job after another, and resents her success. Unfortunately, she’ll need his help to get the house ready for sale because it’ll take more than some new paint on the walls and clearing out a lifetime of memories to get this place on the market. But some houses don’t want to be sold, and their home has other plans for both of them… Like his novels The Southern Book Club’s Guide to Slaying Vampires and The Final Girl Support Group, How to Sell a Haunted House is classic Hendrix: equal parts heartfelt and terrifying—a gripping new read from “the horror master” (USA Today).", "A lonely shopkeeper takes it upon herself to solve a murder in the most peculiar way in this captivating mystery by Jesse Q. Sutanto, bestselling author of Dial A for Aunties. Vera Wong is a lonely little old lady—ah, lady of a certain age—who lives above her forgotten tea shop in the middle of San Francisco’s Chinatown. Despite living alone, Vera is not needy, oh no. She likes nothing more than sipping on a good cup of Wulong and doing some healthy detective work on the Internet about what her Gen-Z son is up to. Then one morning, Vera trudges downstairs to find a curious thing—a dead man in the middle of her tea shop. In his outstretched hand, a flash drive. Vera doesn’t know what comes over her, but after calling the cops like any good citizen would, she sort of . . . swipes the flash drive from the body and tucks it safely into the pocket of her apron. Why? Because Vera is sure she would do a better job than the police possibly could, because nobody sniffs out a wrongdoing quite like a suspicious Chinese mother with time on her hands. Vera knows the killer will be back for the flash drive; all she has to do is watch the increasing number of customers at her shop and figure out which one among them is the killer. What Vera does not expect is to form friendships with her customers and start to care for each and every one of them. As a protective mother hen, will she end up having to give one of her newfound chicks to the police?", "The New York Times bestselling stunning, standalone prequel to The Priory of the Orange Tree. “A magnificent, sweeping epic. Shannon has created a world rich in intricate mythology, beautifully realized and complex.” Jennifer Saint, bestselling author of Ariadne In A Day of Fallen Night, Samantha Shannon sweeps readers back to the universe of Priory of the Orange Tree and into the lives of four women, showing us a course of events that shaped their world for generations to come. Tunuva Melim is a sister of the Priory. For fifty years, she has trained to slay wyrms – but none have appeared since the Nameless One, and the younger generation is starting to question the Priory's purpose. To the north, in the Queendom of Inys, Sabran the Ambitious has married the new King of Hróth, narrowly saving both realms from ruin. Their daughter, Glorian, trails in their shadow – exactly where she wants to be. The dragons of the East have slept for centuries. Dumai has spent her life in a Seiikinese mountain temple, trying to wake the gods from their long slumber. Now someone from her mother's past is coming to upend her fate. When the Dreadmount erupts, bringing with it an age of terror and violence, these women must find the strength to protect humankind from a devastating threat.", "AN INSTANT NEW YORK TIMES BESTSELLER! • A Today Show #ReadWithJenna Book Club Pick \"Sparkling.\" —The New York Times \"An utterly charming and deeply moving portrait of the joys—and the guilt—of trying to find your own way in life.\" —Celeste Ng, #1 New York Times bestselling author of Our Missing Hearts \"Lively, funny, poignant . . . Prepare to fall in love with Maddie. I did!\" —Bonnie Garmus, #1 New York Times bestselling author of Lessons in Chemistry Maame (ma-meh) has many meanings in Twi but in my case, it means woman. It’s fair to say that Maddie’s life in London is far from rewarding. With a mother who spends most of her time in Ghana (yet still somehow manages to be overbearing), Maddie is the primary caretaker for her father, who suffers from advanced stage Parkinson’s. At work, her boss is a nightmare and Maddie is tired of always being the only Black person in every meeting. When her mum returns from her latest trip to Ghana, Maddie leaps at the chance to get out of the family home and finally start living. A self-acknowledged late bloomer, she’s ready to experience some important “firsts”: She finds a flat share, says yes to after-work drinks, pushes for more recognition in her career, and throws herself into the bewildering world of internet dating. But it's not long before tragedy strikes, forcing Maddie to face the true nature of her unconventional family, and the perils—and rewards—of putting her heart on the line. Smart, funny, and deeply affecting, Jessica George's Maame deals with the themes of our time with humor and poignancy: from familial duty and racism, to female pleasure, the complexity of love, and the life-saving power of friendship. Most important, it explores what it feels like to be torn between two homes and cultures―and it celebrates finally being able to find where you belong. \"Meeting Maame feels like falling in love for the first time: warm, awkward, joyous, a little bit heartbreaking and, most of all, unforgettable.\" —Xochitl Gonzalez, New York Times bestselling author of Olga Dies Dreaming", "A NEW YORK TIMES, SUNDAY TIMES AND INDIE BESTSELLER! New York Times bestselling author TJ Klune invites you deep into the heart of a peculiar forest and on the extraordinary journey of a family assembled from spare parts. Most Anticipated from BookPage • Goodreads • The Nerd Daily • Paste Magazine • LitReactor • OverDrive • LGBTQ Reads • Tor.com • LibraryReads • more “An enchanting tale of Pinocchio in the end times.” —P. Djèlí Clark In a strange little home built into the branches of a grove of trees, live three robots—fatherly inventor android Giovanni Lawson, a pleasantly sadistic nurse machine, and a small vacuum desperate for love and attention. Victor Lawson, a human, lives there too. They’re a family, hidden and safe. The day Vic salvages and repairs an unfamiliar android labelled “HAP,” he learns of a shared dark past between Hap and Gio–a past spent hunting humans. When Hap unwittingly alerts robots from Gio’s former life to their whereabouts, the family is no longer hidden and safe. Gio is captured and taken back to his old laboratory in the City of Electric Dreams. So together, the rest of Vic’s assembled family must journey across an unforgiving and otherworldly country to rescue Gio from decommission, or worse, reprogramming. Along the way to save Gio, amid conflicted feelings of betrayal and affection for Hap, Vic must decide for himself: Can he accept love with strings attached? Inspired by Carlo Collodi's The Adventures of Pinocchio, and like Swiss Family Robinson meets Wall-E, In the Lives of Puppets is a masterful stand-alone fantasy adventure from the beloved author who brought you The House in the Cerulean Sea and Under the Whispering Door. ★ “An epic quest of rescue and discovery [with] the author’s trademark charm, heart, and bittersweetness.” —Library Journal, starred review Praise for TJ Klune’s previous work: \"Like being wrapped up in a big gay blanket.\" —V.E. SCHWAB • “Very close to perfect.” —SEANAN McGUIRE • “Utterly absorbing.” —GAIL CARRIGER • \"It will renew your faith in humanity.” —TERRY BROOKS • “It healed me.” —CASSANDRA KHAW • “Compassionate.” —RYKA AOKI At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.", "\"Ryan: She's a distraction, that's what she is. I'm the newest Captain of the Devils, Chicago's NBA team, and the last thing I needed this year was for Indy Ivers, my sister's best friend, to move into my apartment. She's messy, emotional, and way too tempting. But when the team's General Manager vocalizes his blatant disapproval of my promotion to Captain, referring to me as an unapproachable lone wolf with no work-life balance, I can't think of a better way to convince him otherwise than pretending to date my outgoing roommate. The only problem? Faking it feels far too natural. Having a fake girlfriend wasn't supposed to be messy but having Indy under my roof and in my bed is complicated, especially when she wants all the romantic parts of life that I could never give her. Indy: I never imagined I'd be living with my best friend's brother, NBA superstar Ryan Shay. Even more unbelievable? He needs me to act as his loving girlfriend who's suddenly changed him into a friendly and approachable guy. Because, well... he's not. He's controlling of his space and untrusting of others. Our arrangement isn't one-sided, though. I'm in a wedding coming up, one where every one of my childhood friends, including my ex-boyfriend, will be in attendance, and there's no better date than my ex's celebrity hero. Blurred lines make it almost impossible to separate real from fake. Falling for my roommate was never part of the deal, especially when Ryan is quick to remind me that he doesn't believe in love. I'm a romantic and can't help fantasizing that he'll change, but soon enough, I find myself questioning if sharing a roof with my best friend's brother was the right move after all\"--Back cover.", "SPECIAL EDITION – Meet the Dreamland billionaires! Callahan I'm the Kane brother everyone gossips about behind closed doors. Trust fund brat. Washed-up athlete. High-functioning alcoholic. No one knows the real me but her. Lana Castillo―my childhood best friend and the only woman I ever loved. When I broke her heart six years ago, I promised to never return to Lake Wisteria. I kept my word until my grandfather's will changed everything. To receive my inheritance, I was tasked with spending a summer at the family lake house before selling it. The request was simple in theory until my entire plan blew up on the very first day. Turns out Lana doesn't just live at the house, but she claims to own it, too. Alana Falling in love with Callahan Kane was a mistake. He told me so before destroying my heart and our friendship six summers ago. When he promised never to come back, I foolishly believed him. But then Cal showed up again, intending to sell his grandfather's lake house. The biggest flaw in his plan? My name is on the deed. Final Offer is the third book in a series of interconnected standalones following three billionaire brothers. The first one is called The Fine Print.", "She's his opposite in every way . . . and the greatest temptation he's ever known. Reserved, controlled, and proper to a fault, Kai Young has neither the time nor inclination for chaos - and Isabella, with her purple hair and inappropriate jokes, is chaos personified. With a crucial CEO vote looming and a media empire at stake, the billionaire heir can't afford the distraction she brings. Isabella is everything he shouldn't want, but with every look and every touch, he's tempted to break all his rules . . . and claim her as his own. *** Bold, impulsive, and full of life, Isabella Valencia has never met a party she doesn't like or a man she couldn't charm . . . except for Kai Young. It shouldn't matter. He's not her type - the man translates classics into Latin for fun, and his membership at the exclusive club where she bartends means he's strictly off limits. But she can't deny that, beneath his cool exterior, is a man who could make her melt with just a touch. No matter how hard they try, they can't resist giving into their forbidden desires. Even if it costs them everything.", "\"Fans of Circe and Elektra should pick up this powerful Greek myth retelling.\" —Cosmopolitan For fans of Madeline Miller, a stunning debut following Clytemnestra, the most notorious villainess of the ancient world and the events that forged her into the legendary queen. As for queens, they are either hated or forgotten. She already knows which option suits her best... You were born to a king, but you marry a tyrant. You stand by helplessly as he sacrifices your child to placate the gods. You watch him wage war on a foreign shore, and you comfort yourself with violent thoughts of your own. Because this was not the first offence against you. This was not the life you ever deserved. And this will not be your undoing. Slowly, you plot. But when your husband returns in triumph, you become a woman with a choice. Acceptance or vengeance, infamy follows both. So, you bide your time and force the gods' hands in the game of retribution. For you understood something long ago that the others never did. If power isn't given to you, you have to take it for yourself. A blazing novel set in the world of Ancient Greece, this is a thrilling tale of power and prophecies, of hatred, love, and of an unforgettable Queen who fiercely dealt out death to those who wronged her. \"Crackles with vivid fury, passion, and strength.\" —Jennifer Saint, bestselling author of Elektra and Ariadne", "Love is a sacrifice at the altar of power. In the wake of the Kejari, everything Oraya once thought to be true has been destroyed. A prisoner in her own kingdom, grieving the only family she ever had, and reeling from a gutting betrayal, she no longer even knows the truth of her own blood. She's left only with one certainty: she cannot trust anyone, least of all Raihn. The House of Night, too, is surrounded by enemies. Raihn's own nobles are none too eager to accept a Turned king, especially one who was once a slave. And the House of Blood digs their claws into the kingdom, threatening to tear it apart from the inside. When Raihn offers Oraya a secret alliance, taking the deal is her only chance at reclaiming her kingdom-and gaining her vengeance against the lover who betrayed her. But to do so, she'll need to harness a devastating ancient power, intertwined with her father's greatest secrets. But with enemies closing in on all sides, nothing is as it seems. As she unravels her past and faces her future, Oraya finds herself forced to choose between the bloody reality of seizing power - and the devastating love that could be her downfall. Full of heartbreak, redemption, bloody intrigue, and heart-pounding action, The Ashes and the Star-Cursed King is the gutting second installment of the Crowns of Nyaxia series, and the conclusion of the Nightborn Duet - perfect for fans of From Blood and Ash and A Court of Thorns and Roses.", "Hunger Games meets House of Dragon in this epic fantasy romance series. Perfect for fans of Leigh Bardugo, Sarah J Maas and dark academia.[Bokinfo].", "Bestselling Camilla Isley returns with this gorgeously funny enemies-to-lovers rom com, perfect for fans of Sarah Adams, Lynn Painter and Jo Watson. She's a self-made fitness sensation. He's a billionaire mogul. They're sworn enemies and rivals... aren't they? Blake Avery knows all about hard work. She’s gone from making videos in her teenage bedroom to founding a booming fitness business and opening a state-of-the-art Manhattan gym. Now she’s on the cusp of realizing her wildest dreams, and she’s not going to let anyone stand in her way. Certainly not man-of-the-hour Gabriel Mercer. He might be one of the biggest names in the fitness world and set women’s pulses soaring more than a grueling HIIT workout, but he grew up in a billionaire dynasty and had everything handed to him – or so Blake thinks. But when Blake publicly criticizes Gabriel, she sparks a feud that neither entrepreneur is willing to back down from. And in an industry that seems determined to keep pushing them together, can Blake hold on to her grudge? Or will she finally warm up to Gabriel's charm?", "Only his memories can save her… A great primal power has risen. The Queen of Flesh and Fire has become the Primal of Blood and Bone—the true Primal of Life and Death. And the battle Casteel, Poppy, and their allies have been fighting has only just begun. Gods are awakening across Iliseeum and the mortal realm, readying for the war to come. But when Poppy falls into stasis, Cas faces the very real possibility that the dire, unexpected consequences of what she is becoming could take her away from him. Cas is given some advice, though—something he plans to cling to as he waits to see her beautiful eyes open once more: Talk to her. And so, he does. He reminds Poppy how their journey began, revealing things about himself that only Kieran knows in the process. But it’s anybody’s guess what she’ll wake to or exactly how much of the realm and Cas will have changed when she does. #1 New York Times bestselling author Jennifer L. Armentrout revisits Poppy and Casteel’s epic love story in the next installment of the Blood and Ash series. But this time, Hawke gets to tell the tale.", "It was one of the most searing images of the twentieth century: two young boys, two princes, walking behind their mother’s coffin as the world watched in sorrow—and horror. As Diana, Princess of Wales, was laid to rest, billions wondered what the princes must be thinking and feeling—and how their lives would play out from that point on. For Harry, this is that story at last. With its raw, unflinching honesty, Spare is a landmark publication full of insight, revelation, self-examination, and hard-won wisdom about the eternal power of love over grief.", "\"This weird, lovely and sweetly satisfying novel [is] engaging and accessible...Clover’s emergence from a shuttered life is moving enough to elicit tears, and Brammer’s take on death and grieving is profound enough to feel genuinely instructional.\" ––The New York Times Book Review What’s the point of giving someone a beautiful death if you can’t give yourself a beautiful life? From the day she watched her kindergarten teacher drop dead during a dramatic telling of Peter Rabbit, Clover Brooks has felt a stronger connection with the dying than she has with the living. After the beloved grandfather who raised her dies alone while she is traveling, Clover becomes a death doula in New York City, dedicating her life to ushering people peacefully through their end-of-life process. Clover spends so much time with the dying that she has no life of her own, until the final wishes of a feisty old woman send Clover on a trip across the country to uncover a forgotten love story––and perhaps, her own happy ending. As she finds herself struggling to navigate the uncharted roads of romance and friendship, Clover is forced to examine what she really wants, and whether she’ll have the courage to go after it. Probing, clever, and hopeful, The Collected Regrets of Clover is perfect for readers of The Midnight Library and Eleanor Oliphant is Completely Fine as it turns the normally taboo subject of death into a reason to celebrate life.", "INSTANT NEW YORK TIMES BESTSELLER The latest historical novel from New York Times bestselling author Lisa See, inspired by the true story of a woman physician from 15th-century China—perfect for fans of See’s classic Snow Flower and the Secret Fan and The Island of Sea Women. According to Confucius, “an educated woman is a worthless woman,” but Tan Yunxian—born into an elite family, yet haunted by death, separations, and loneliness—is being raised by her grandparents to be of use. Her grandmother is one of only a handful of female doctors in China, and she teaches Yunxian the pillars of Chinese medicine, the Four Examinations—looking, listening, touching, and asking—something a man can never do with a female patient. From a young age, Yunxian learns about women’s illnesses, many of which relate to childbearing, alongside a young midwife-in-training, Meiling. The two girls find fast friendship and a mutual purpose—despite the prohibition that a doctor should never touch blood while a midwife comes in frequent contact with it—and they vow to be forever friends, sharing in each other’s joys and struggles. No mud, no lotus, they tell themselves: from adversity beauty can bloom. But when Yunxian is sent into an arranged marriage, her mother-in-law forbids her from seeing Meiling and from helping the women and girls in the household. Yunxian is to act like a proper wife—embroider bound-foot slippers, pluck instruments, recite poetry, give birth to sons, and stay forever within the walls of the family compound, the Garden of Fragrant Delights. How might a woman like Yunxian break free of these traditions, go on to treat women and girls from every level of society, and lead a life of such importance that many of her remedies are still used five centuries later? How might the power of friendship support or complicate these efforts? Lady Tan’s Circle of Women is a captivating story of women helping other women. It is also a triumphant reimagining of the life of a woman who was remarkable in the Ming dynasty and would be considered remarkable today.", "AN INSTANT NEW YORK TIMES BESTSELLER From Tessa Bailey—#1 New York Times bestselling author, TikTok favorite, and \"the Michelangelo of dirty talk\" (Entertainment Weekly)—comes a spicy small town rom-com about a grumpy professor and the bubbly neighbor he clashes with at every turn... Hallie Welch fell hard for Julian Vos at fourteen, after they almost kissed in the dark vineyards of his family’s winery. Now the prodigal hottie has returned to Napa Valley, and when Hallie is hired to revamp the gardens on the Vos estate, she wonders if she'll finally get that smooch. But the starchy professor isn’t the teenager she remembers and their polar opposite personalities clash spectacularly. One wine-fueled girls’ night later, Hallie can’t shake the sense that she did something reckless—and then she remembers the drunken secret admirer letter she left for Julian. Oh shit. On sabbatical from his ivy league job, Julian plans to write a novel. But having Hallie gardening right outside his window is the ultimate distraction. She’s eccentric, chronically late, often literally covered in dirt—and so unbelievably beautiful, he can’t focus on anything else. Until he finds an anonymous letter sent by a woman from his past. Even as Julian wonders about this admirer, he’s sucked further into Hallie’s orbit. Like the flowers she plants all over town, Hallie is a burst of color in Julian’s grayscale life. For a man who irons his socks and runs on tight schedules, her sunny chaotic energy makes zero sense. But there’s something so familiar about her... and her very presence is turning his world upside down. \"Tessa Bailey is the queen of rom-coms. Long may she reign!\" — Julie Murphy, #1 New York Times bestselling author of A Merry Little Meet Cute", "One hundred and fifty years ago the Fae race vanished. Along with their magic and creatures. With the fallen Fae lands the humans were soon to follow as corruption spread throughout the realm. Heir to the throne, Delilah Covington is forced to watch her people suffer under the sinful hands of her father, the king-while she herself suffers his cruel hand. Delilah has longed for change, her prayers going unanswered until she discovers salvation.Fae are alive.In desperation, Delilah flees her home and crosses the border, in hopes that the Fae will save her people.Yet she isn't the only one who needs help.Caught in a web of lies and riddles Delilah's only chance at hope is Knox, one of the irritating, yet frustratingly charming Fae kings. Together they'll need to unravel the many mysteries to bring freedom to both their oppressed people, or damn them all.", "Designed as an introduction to emergency management, this book includes pieces on: social, political, and fiscal aspects of risk management; land-use planning and building code enforcement regulations; insurance issues; emergency management systems; and managing natural and manmade disasters.", "Sparks fly when a romance writer and a documentary filmmaker join forces to craft the ultimate Hollywood love story—but only if they can keep the chemistry between them from taking the whole thing off script—from the “divine” (Jodi Picoult) New York Times bestselling authors of The Soulmate Equation and The Unhoneymooners. Felicity “Fizzy” Chen is lost. Sure, she’s got an incredible career as a beloved romance novelist with a slew of bestsellers under her belt, but when she’s asked to give a commencement address, it hits her: she hasn’t been practicing what she’s preached. Fizzy hasn’t ever really been in love. Lust? Definitely. But that swoon-worthy, can’t-stop-thinking-about-him, all-encompassing feeling? Nope. Nothing. What happens when the optimism she’s spent her career encouraging in readers starts to feel like a lie? Connor Prince, documentary filmmaker and single father, loves his work but when his profit-minded boss orders him to create a reality TV show, putting his job on the line, Connor is out of his element. Desperate to find his romantic lead, a chance run-in with an exasperated Fizzy offers Connor the perfect solution. What if he could show the queen of romance herself falling head-over-heels for all the world to see? Fizzy gives him a hard pass—unless he agrees to her list of demands. When he says yes, and production on The True Love Experiment begins, Connor wonders if that perfect match will ever be in the cue cards for him, too. “Full of big laughs, a few tears, and some seriously steamy scenes” (Kirkus Reviews, starred review), The True Love Experiment is the book fans have been waiting for ever since Fizzy’s debut in the New York Times bestselling The Soulmate Equation.", "INSTANT NEW YORK TIMES BESTSELLER “Sex, suspense, and the supernatural fuel this propulsive debut.” —People A young author is invited to an exclusive writer’s retreat that soon descends into a pulse-pounding nightmare—in the vein of The Plot and Please Join Us. Alex has all but given up on her dreams of becoming a published author when she receives a once-in-a-lifetime opportunity: attend an exclusive, month-long writing retreat at the estate of feminist horror writer Roza Vallo. Even the knowledge that Wren, her former best friend and current rival, is attending doesn’t dampen her excitement. But when the attendees arrive, Roza drops a bombshell—they must all complete an entire novel from scratch during the next month, and the author of the best one will receive a life-changing seven-figure publishing deal. Determined to win this seemingly impossible contest, Alex buckles down and tries to ignore the strange happenings at the estate, including Roza’s erratic behavior, Wren’s cruel mind games, and the alleged haunting of the mansion itself. But when one of the writers vanishes during a snowstorm, Alex realizes that something very sinister is afoot. With the clock running out, she must discover the truth—or suffer the same fate. A claustrophobic and propulsive thriller that “will keep you up all night with its intriguing premise and gasp-worthy twists” (Kirthana Ramisetti, author of Dava Shastri’s Last Day), The Writing Retreat expertly explores the dark side of female relationships, fame, and the desire to have our stories told.", "They were eleven when they sent a killer to prison. They were heroes . . . but they were liars. Kate Alice Marshall's What Lies in the Woods is a thrilling novel about friendship, secrets, betrayal, and lies - and having the courage to face the past. \"Clever and deliciously dark.” —Alice Feeney, bestselling author of Rock Paper Scissors “Unexpected plot twists, deep psychological perspicacity, and an endlessly interesting dance between past and present...evokes the dread and intensity of Gillian Flynn’s Sharp Objects.” —New York Times Book Review Naomi Shaw used to believe in magic. Twenty-two years ago, she and her two best friends, Cassidy and Olivia, spent the summer roaming the woods, imagining a world of ceremony and wonder. They called it the Goddess Game. The summer ended suddenly when Naomi was attacked. Miraculously, she survived her seventeen stab wounds and lived to identify the man who had hurt her. The girls’ testimony put away a serial killer, wanted for murdering six women. They were heroes. And they were liars. For decades, the friends have kept a secret worth killing for. But now Olivia wants to tell, and Naomi sets out to find out what really happened in the woods—no matter how dangerous the truth turns out to be. “What Lies In the Woods is a gorgeous fever dream of a novel about the dangers lurking in the hearts and imaginations of little girls. Kate Alice Marshall deftly charts a winding path through her creepy woods, doubling back and changing course to build a labyrinth of secrets and lies in which I was delighted to lose myself for hours. Hands down, it's the best thriller I've read in a long, long time.”—Chandler Baker, bestselling author of The Husbands “Shines an incisive light on the secrets of a small-town community...Great writing and boldly drawn characters bring a terrifying tale to all-too-vivid life.” —Kirkus, starred review", "THE ALL NEW NOVEL FROM THE NEW YORK TIMES MILLION-COPY BESTSELLING AUTHOR THE HIGHLY ANTICIPATED FOLLOW-UP TO TIKTOK SENSATION THINGS WE NEVER GOT OVER AND 2023'S THINGS WE HIDE FROM THE LIGHT ________________________________________________________________________ There was only one woman who could set me free. But I would rather set myself on fire than ask Sloane Walton for anything. Lucian Rollins is a lean, mean vengeance-seeking mogul. Determined to erase his abusive father's mark on his family name, he spends every waking minute pulling strings and building his empire. The more money and power he gains, the safer he feels. Except when it comes to one feisty small-town librarian. Although they are bonded by a dark secret from the past and their current mutual disdain, Sloane Walton only trusts Lucian as far as she can throw him. Until their bickering accidentally turns to foreplay, fanning flames of desire that can't be put out. But with Sloane eager to start a family and Lucian refusing to even consider the idea, these enemies-to-lovers are stuck at an impasse. And when Lucian learns the hard way that leaving Sloane is impossible, he vows to do everything he can to keep her safe. Whatever the cost . . .", "A story of mix-ups, mess-ups and making the most of second chances, this is the new novel from #1 New York Times bestselling author Jojo Moyes, author of Me Before You and The Giver of Stars Who are you when you are forced to walk in someone else’s shoes? Nisha Cantor lives the globetrotting life of the seriously wealthy, until her husband announces a divorce and cuts her off. Nisha is determined to hang onto her glamorous life. But in the meantime, she must scramble to cope--she doesn’t even have the shoes she was, until a moment ago, standing in. That’s because Sam Kemp – in the bleakest point of her life – has accidentally taken Nisha’s gym bag. But Sam hardly has time to worry about a lost gym bag--she’s struggling to keep herself and her family afloat. When she tries on Nisha’s six-inch high Christian Louboutin red crocodile shoes, the resulting jolt of confidence that makes her realize something must change—and that thing is herself. Full of Jojo Moyes’ signature humor, brilliant storytelling, and warmth, Someone Else’s Shoes is a story about how just one little thing can suddenly change everything.", "In the spirit of Where the Crawdads Sing, and set amid the beauty and wilderness of the Colorado mountains, an unforgettable and deeply moving story of a young woman who follows her heart Seventeen-year-old Victoria Nash runs the household on her family's peach farm in the small ranch town of Iola, Colorado—the sole surviving female in a family of troubled men. Wilson Moon is a young drifter with a mysterious past, displaced from his tribal land but determined to live as he chooses. Victoria's chance encounter with Wil on a street corner profoundly alters both of their young lives, igniting as much passion as danger. When tragedy strikes, Victoria leaves the only life she has ever known, fleeing into the nearby mountains. Taking shelter in a small hut, she struggles to survive in the wilderness, with no clear notion of what her future will be. As the seasons change, she also charts the changes in herself, finding in the natural world the strength and meaning that set her on a quest to regain all that she has lost, even as the Gunnison River rises to submerge her homeland—its ranches, farms, and the beloved peach orchard that has been in her family for generations. Inspired by true events surrounding the destruction of the town of Iola in the 1960s, Go as a River is a story of deeply held love in the midst of hardship and loss, but also of finding courage, resilience, friendship, and finally, home—where least expected. This stunning debut explores what it means to lead your life as if it were a river—gathering and flowing, finding a way forward even when the river is dammed.", "A new town, new friends, new challenges.... And a new heart-stopping adventure from #1 New York Times bestselling author, Ilona Andrews. Kate, Curran, and Conlan may have left Atlanta for Wilmington, but the usual magic mayhem has also hitched a ride! Kate and Curran have just settled into their new home and their 'low profile,' when a local businessman approaches them with an offer they can’t refuse. A mysterious evil has spawned in the nearby forest and is holding a defenseless town hostage. The ‘due date’ is rapidly approaching. It’s exactly the kind of fight the Lennarts can’t resist, not for the prize the town offers, but for the people who will surely die if they ignore it. If they succeed, they’ll be rescuing an entire community and can build a strong new base for their family and the Wilmington Pack. If they fail...well, fail is a four-letter word. Nothing comes without a price. Now Kate must decide if she has what it takes to pay it.", "Love, duty, and danger collide in Edwardian London, as the Shadowhunters face the greatest threat they have ever known.", [], "\"Fifteen-year-old Ruby Pearsall is on track to becoming the first in her family to attend college, in spite of having a mother more interested in keeping a man than raising her daughter. But a taboo love affair threatens to pull her back down into the poverty and desperation that has been passed onto her like a birthright. Eleanor Quarles arrived in Washington, DC with ambition and secrets. When she meets the handsome William Pride at Howard University, they fall madly in love. But William hails from one of DC's elite wealthy Black families, and his parents don't just let anyone into their fold. Eleanor hopes that a baby will make her finally feel at home in William's family and grant her the life she's been searching for. But having a baby, and fitting in, is easier said than done. The lives of these two women collide in the most unexpected way as they both face life altering decisions\"--Publisher marketing.", "INSTANT NEW YORK TIMES BESTSELLER \"A brave and original debut, Weyward is a spellbinding story about what may transpire when the natural world collides with a legacy of witchcraft.\" ––Sarah Penner, New York Times bestselling author of The Lost Apothecary I am a Weyward, and wild inside. 2019: Under cover of darkness, Kate flees London for ramshackle Weyward Cottage, inherited from a great aunt she barely remembers. With its tumbling ivy and overgrown garden, the cottage is worlds away from the abusive partner who tormented Kate. But she begins to suspect that her great aunt had a secret. One that lurks in the bones of the cottage, hidden ever since the witch-hunts of the 17th century. 1619: Altha is awaiting trial for the murder of a local farmer who was stampeded to death by his herd. As a girl, Altha’s mother taught her their magic, a kind not rooted in spell casting but in a deep knowledge of the natural world. But unusual women have always been deemed dangerous, and as the evidence for witchcraft is set out against Altha, she knows it will take all of her powers to maintain her freedom. 1942: As World War II rages, Violet is trapped in her family's grand, crumbling estate. Straitjacketed by societal convention, she longs for the robust education her brother receives––and for her mother, long deceased, who was rumored to have gone mad before her death. The only traces Violet has of her are a locket bearing the initial W and the word weyward scratched into the baseboard of her bedroom. Weaving together the stories of three extraordinary women across five centuries, Emilia Hart's Weyward is an enthralling novel of female resilience and the transformative power of the natural world.", "Ilona Andrews invites you back to the #1 New York Times bestselling Kate Daniels series in this exciting new long novella featuring Kate, Curran and Conlan, some familiar faces, some new friends, and all the special brand of chaos they create! Kate, Curran and their son, Conlan have left Atlanta, vowing to keep a low profile, and are settling into a new city and new house...but some things never change! Magical mayhem is about to erupt when Kate undertakes the rescue of a kidnapped youth, while Curran guards the homefront. It should be a simple retrieval, but with monsters on land and sea, Kate’s got her work cut out for her. Still, she's never let her blade dull or her purpose falter. And that low profile? It’s about to wash away with the raging tides!", [], "From the #1 New York Times bestselling author of The Passage comes a riveting standalone novel about a group of survivors on a hidden island utopia--where the truth isn't what it seems. Founded by a mysterious genius, the archipelago of Prospera lies hidden from the horrors of a deteriorating outside world. In this island paradise, Prospera's lucky citizens enjoy long, fulfilling lives until the monitors embedded in their forearms, meant to measure their physical health and psychological well-being, fall below 10 percent. Then they retire themselves, embarking on a ferry ride to the island known as the Nursery, where their failing bodies are renewed, their memories are wiped clean, and they are readied to restart life afresh. Proctor Bennett, of the Department of Social Contracts, has a satisfying career as a ferryman, gently shepherding people through the retirement process--and, when necessary, enforcing it. But all is not well with Proctor. For one thing, he's been dreaming--which is supposed to be impossible in Prospera. For another, his monitor percentage has begun to drop alarmingly fast. And then comes the day he is summoned to retire his own father, who gives him a disturbing and cryptic message before being wrestled onto the ferry. Meanwhile, something is stirring. The support staff, ordinary men and women who provide the labor to keep Prospera running, have begun to question their place in the social order. Unrest is building, and there are rumors spreading of a resistance group--known as Arrivalists--who may be fomenting revolution. Soon Proctor finds himself questioning everything he once believed, entangled with a much bigger cause than he realized--and on a desperate mission to uncover the truth.", "In the tradition of Craig Johnson and C. J. Box, Bruce Borgos's The Bitter Past begins a compelling series set in the high desert of Nevada featuring Sheriff Porter Beck... Porter Beck is the sheriff in the high desert of Nevada, north of Las Vegas. Born and raised there, he left to join the Army, where he worked in Intelligence, deep in the shadows in far off places. Now he's back home, doing the same lawman's job his father once did, before his father started to develop dementia. All is relatively quiet in this corner of the world, until an old, retired FBI agent is found killed. He was brutally tortured before he was killed and clues at the scene point to a mystery dating back to the early days of the nuclear age. If that wasn't strange enough, a current FBI agent shows up to help Beck's investigation. In a case that unfolds in the past (the 1950s) and the present, it seems that a Russian spy infiltrated the nuclear testing site and now someone is looking for that long-ago, all-but forgotten person, who holds the key to what happened then and to the deadly goings on now.", "Blue skies, empty land—and enough wide-open space to hide a horrifying secret. A woman with a past, a mysterious trunk, a town on the edge of nowhere, and a bracing new vision of the American West, from the award-winning author of The Changeling. ”If the literary gods mixed together Haruki Murakami and Ralph Ellison, the result would be Victor LaValle.”—Anthony Doerr, Pulitzer Prize-winning author of All the Light We Cannot See Adelaide Henry carries an enormous steamer trunk with her wherever she goes. It’s locked at all times. Because when the trunk opens, people around Adelaide start to disappear. The year is 1915, and Adelaide is in trouble. Her secret sin killed her parents, forcing her to flee California in a hellfire rush and make her way to Montana as a homesteader. Dragging the trunk with her at every stop, she will become one of the “lone women” taking advantage of the government’s offer of free land for those who can tame it—except that Adelaide isn’t alone. And the secret she’s tried so desperately to lock away might be the only thing that will help her survive the harsh territory. Crafted by a modern master of magical suspense, Lone Women blends shimmering prose, an unforgettable cast of adventurers who find horror and sisterhood in a brutal landscape, and a portrait of early-twentieth-century America like you’ve never seen. And at its heart is the gripping story of a woman desperate to bury her past—or redeem it.", "NATIONAL BESTSELLER • A READ WITH JENNA BOOK CLUB PICK • Two top women gladiators fight for their freedom within a depraved private prison system not so far-removed from America’s own in this explosive, hotly-anticipated debut novel from the New York Times bestselling author of Friday Black “Like Orwell’s 1984 and Atwood’s The Handmaid’s Tale, Adjei-Brenyah’s book presents a dystopian vision so…illuminating that it should permanently shift our understanding of who we are and what we’re capable of doing.” —The Washington Post “This book will change you!...A masterpiece.” —Jenna Bush Hager, The Today Show’s #ReadWithJenna She felt their eyes, all those executioners… Loretta Thurwar and Hamara “Hurricane Staxxx” Stacker are the stars of Chain-Gang All-Stars, the cornerstone of CAPE, or Criminal Action Penal Entertainment, a highly-popular, highly-controversial, profit-raising program in America’s increasingly dominant private prison industry. It’s the return of the gladiators and prisoners are competing for the ultimate prize: their freedom. In CAPE, prisoners travel as Links in Chain-Gangs, competing in death-matches for packed arenas with righteous protestors at the gates. Thurwar and Staxxx, both teammates and lovers, are the fan favorites. And if all goes well, Thurwar will be free in just a few matches, a fact she carries as heavily as her lethal hammer. As she prepares to leave her fellow Links, she considers how she might help preserve their humanity, in defiance of these so-called games, but CAPE’s corporate owners will stop at nothing to protect their status quo and the obstacles they lay in Thurwar’s path have devastating consequences. Moving from the Links in the field to the protestors to the CAPE employees and beyond, Chain-Gang All-Stars is a kaleidoscopic, excoriating look at the American prison system’s unholy alliance of systemic racism, unchecked capitalism, and mass incarceration, and a clear-eyed reckoning with what freedom in this country really means from a “new and necessary American voice” (Tommy Orange, The New York Times Book Review).", "Instant #1 New York Times bestseller! Full of explosive magic, searing romance, and heartbreaking betrayal, this breathtaking sequel to This Woven Kingdom is from the award-winning and bestselling author of the Shatter Me series and is perfect for fans of Leigh Bardugo, Sabaa Tahir, and Tomi Adeyemi. With the heat of a kiss, the walls between Alizeh, the long-lost heir to an ancient Jinn kingdom, and Kamran, the crown prince of the Ardunian empire, have crumbled. And so have both of their lives. Alizeh, the heir to the Jinn throne, is destined to free her people from the half-lives they’ve been forced to live under human rule. When Kamran, the heir to the human throne, falls in love with her, he’s forced to question everything he’s been taught about Jinn. Kamran’s grandfather lays dead at the hand of Cyrus, ruler of the neighboring kingdom of Tulan. Cyrus has stolen Alizeh away to his homeland and plans to marry her there, giving her everything she needs to become the Jinn queen—and when she assumes the throne he will have fulfilled his own bargain with the devil. Alizeh wants nothing to do with Cyrus’s deal or the devil. But without a way to escape Tulan, and with the fulfillment of her own destiny tantalizingly close, she’ll have to decide whether she can set aside her emotions to become the queen her people need. Kamran, meanwhile, is picking up the pieces in Ardunia. Facing betrayal at every turn, all he knows is that he must go to Tulan to avenge his grandfather. He can only hope that Alizeh will be waiting for him there—and that she hasn’t yet become the queen of Tulan.", "Ever since Jacob Reckless was a child, he has been escaping to a hidden world through a portal in his father's abandoned study. Over the years, he has made a name for himself as a finder of enchanted items and buried secrets. He's also made many enemies and allies--most important, Fox, a beautiful shape-shifting vixen whom Jacob cares for more than he lets on. But life in this other world is about to change. Tragedy strikes when Jacob's younger brother, Will, follows him through the portal. Brutally attacked, Will is infected with a curse that is quickly transforming him into a Goyl--a ruthless killing machine, with skin made of stone. Jacob is prepared to fight to save his brother, but in a land built on trickery and lies, Jacob will need all the wit, courage, and reckless spirit he can summon to reverse the dark spell--before it's too late.", "Years ago, a reclusive mega-bestselling children’s author quit writing under mysterious circumstances. Suddenly he resurfaces with a brand-new book and a one-of-a-kind competition, offering a prize that will change the winner’s life in this absorbing and whimsical novel. “Clever and hopeful . . . a love letter to reading and the power that childhood stories have over us long after we've grown up.”—V. E. Schwab, #1 New York Times bestselling author of The Invisible Life of Addie LaRue Make a wish. . . . Lucy Hart knows better than anyone what it’s like to grow up without parents who loved her. In a childhood marked by neglect and loneliness, Lucy found her solace in books, namely the Clock Island series by Jack Masterson. Now a twenty-six-year-old teacher’s aide, she is able to share her love of reading with bright, young students, especially seven-year-old Christopher Lamb, who was left orphaned after the tragic death of his parents. Lucy would give anything to adopt Christopher, but even the idea of becoming a family seems like an impossible dream without proper funds and stability. But be careful what you wish for. . . . Just when Lucy is about to give up, Jack Masterson announces he’s finally written a new book. Even better, he’s holding a contest at his home on the real Clock Island, and Lucy is one of the four lucky contestants chosen to compete to win the one and only copy. For Lucy, the chance of winning the most sought-after book in the world means everything to her and Christopher. But first she must contend with ruthless book collectors, wily opponents, and the distractingly handsome (and grumpy) Hugo Reese, the illustrator of the Clock Island books. Meanwhile, Jack “the Mastermind” Masterson is plotting the ultimate twist ending that could change all their lives forever. . . . You might just get it.", "From the internationally bestselling author of Vespertine comes a heart-stopping new sequel novella to the breathtaking fantasy Sorcery of Thorns. This is the perfect read for fans of Cassandra Clare, Sarah J. Maas’s A COURT OF THORNS AND ROSES series, and Holly Black! Elisabeth Scrivener is finally settling into her new life with sorcerer Nathaniel Thorn. Now that their demon companion Silas has returned, so has scrutiny from nosy reporters hungry for gossip about the city’s most powerful sorcerer and the librarian who stole his heart. But something strange is afoot at Thorn Manor: the estate’s wards, which are meant to keep their home safe, are acting up and forcibly trapping the Manor’s occupants inside. Surely it must be a coincidence that this happened just as Nathaniel and Elisabeth started getting closer to one another . . . ? With no access to the outside world, Elisabeth and Nathaniel have to work together to discover the source of the magic before they’re due to host the city’s Midwinter Ball. Faced with a house filled with unexpected secrets, the couple will have to lean on their connection like never before to set things right before it’s too late . . . Praise for New York Times bestselling Sorcery of Thorns: 'A bewitching gem . . . I absolutely loved every moment of this story' – Stephanie Garber, #1 New York Times bestselling author of the Caraval series 'If you loved the Hogwarts Library . . . you’ll be right at home at Summershall' – Katherine Arden, New York Times bestselling author of The Bear and the Nightingale 'An enthralling adventure replete with spellbinding characters, a slow-burning love story, and a world worth staying lost in' – Kirkus Reviews, starred review", "NATIONAL BESTSELLER • “The lives of a Jewish boy escaping Nazi-occupied Europe and a mother and daughter fleeing twenty-first-century El Salvador intersect in this ambitious, intricate novel about war and immigration” (People), from the New York Times bestselling author of A Long Petal of the Sea and Violeta “Allende’s storytelling walks a lyrical romanticism on roads imposed by social and political turmoil.”—NPR Vienna, 1938. Samuel Adler is five years old when his father disappears during Kristallnacht—the night his family loses everything. As her child’s safety becomes ever harder to guarantee, Samuel’s mother secures a spot for him on a Kindertransport train out of Nazi-occupied Austria to England. He boards alone, carrying nothing but a change of clothes and his violin. Arizona, 2019. Eight decades later, Anita Díaz and her mother board another train, fleeing looming danger in El Salvador and seeking refuge in the United States. But their arrival coincides with the new family separation policy, and seven-year-old Anita finds herself alone at a camp in Nogales. She escapes her tenuous reality through her trips to Azabahar, a magical world of the imagination. Meanwhile, Selena Durán, a young social worker, enlists the help of a successful lawyer in hopes of tracking down Anita’s mother. Intertwining past and present, The Wind Knows My Name tells the tale of these two unforgettable characters, both in search of family and home. It is both a testament to the sacrifices that parents make and a love letter to the children who survive the most unfathomable dangers—and never stop dreaming.", "\"Chokshi's tale is as sweet as a piece of fairy fruit, and just as wicked. Every bite is velvet, every swallow is gold, and the taste lingers like a fever dream.\" — V. E. Schwab, #1 New York Times bestselling author of The Invisible Life of Addie LaRue \"A delightfully meta fairy tale. . . . Magic emanates from every exquisitely crafted sentence. . . . It feels like the best conjuring trick ever.\" — Charlie Jane Anders, Washington Post A sumptuous, gothic-infused story about a marriage that is unraveled by dark secrets, a friendship cursed to end in tragedy, and the danger of believing in fairy tales—the breathtaking adult debut from New York Times bestselling author Roshani Chokshi. Once upon a time, a man who believed in fairy tales married a beautiful, mysterious woman named Indigo Maxwell-Casteñada. He was a scholar of myths. She was heiress to a fortune. They exchanged gifts and stories and believed they would live happily ever after—and in exchange for her love, Indigo extracted a promise: that her bridegroom would never pry into her past. But when Indigo learns that her estranged aunt is dying and the couple is forced to return to her childhood home, the House of Dreams, the bridegroom will soon find himself unable to resist. For within the crumbling manor’s extravagant rooms and musty halls, there lurks the shadow of another girl: Azure, Indigo’s dearest childhood friend who suddenly disappeared. As the house slowly reveals his wife’s secrets, the bridegroom will be forced to choose between reality and fantasy, even if doing so threatens to destroy their marriage . . . or their lives. Combining the lush, haunting atmosphere of Mexican Gothic with the dreamy enchantment of The Invisible Life of Addie LaRue, The Last Tale of the Flower Bride is a spellbinding and darkly romantic page-turner about love and lies, secrets and betrayal, and the stories we tell ourselves to survive. \"Gorgeous and ornate, this sensual fairy tale illuminates the corrosive and redemptive power of both love and lies.\" — Holly Black, #1 New York Times bestselling author of Book of Night \"A fairy tale in the oldest and truest sense: a haunting dream full of blood and love, vicious truths and beautiful lies. It swallowed me whole, and I went willingly.\" — Alix E. Harrow, New York Times bestselling author of The Once and Future Witches", "GOOD MORNING AMERICA BUZZ PICK • A young Indian woman finds the false rumors that she killed her husband surprisingly useful—until other women in the village start asking for her help getting rid of their own husbands—in this razor-sharp debut. \"A radically feel-good story about the murder of no-good husbands by a cast of unsinkable women.”—The New York Times Book Review Five years ago, Geeta lost her no-good husband. As in, she actually lost him—he walked out on her and she has no idea where he is. But in her remote village in India, rumor has it that Geeta killed him. And it’s a rumor that just won’t die. It turns out that being known as a “self-made” widow comes with some perks. No one messes with her, harasses her, or tries to control (ahem, marry) her. It’s even been good for business; no one dares to not buy her jewelry. Freedom must look good on Geeta, because now other women are asking for her “expertise,” making her an unwitting consultant for husband disposal. And not all of them are asking nicely. With Geeta’s dangerous reputation becoming a double-edged sword, she has to find a way to protect the life she’s built—but even the best-laid plans of would-be widows tend to go awry. What happens next sets in motion a chain of events that will change everything, not just for Geeta, but for all the women in their village. Filled with clever criminals, second chances, and wry and witty women, Parini Shroff’s The Bandit Queens is a razor-sharp debut of humor and heart that readers won’t soon forget.", "Named a Most Anticipated Book of 2023 by Oprah Daily, Elle, and LitHub! A LibraryReads Pick for March 2023! From Jeannette Walls, the #1 New York Times bestselling author of The Glass Castle, comes a riveting new novel about an indomitable young woman in Virginia during Prohibition. Most folk thought Sallie Kincaid was a nobody who’d amount to nothing. Sallie had other plans. Sallie Kincaid is the daughter of the biggest man in a small town, the charismatic Duke Kincaid. Born at the turn of the 20th century into a life of comfort and privilege, Sallie remembers little about her mother who died in a violent argument with the Duke. By the time she is just eight years old, the Duke has remarried and had a son, Eddie. While Sallie is her father’s daughter, sharp-witted and resourceful, Eddie is his mother’s son, timid and cerebral. When Sallie tries to teach young Eddie to be more like their father, her daredevil coaching leads to an accident, and Sallie is cast out. Nine years later, she returns, determined to reclaim her place in the family. That’s a lot more complicated than Sallie expected, and she enters a world of conflict and lawlessness. Sallie confronts the secrets and scandals that hide in the shadows of the Big House, navigates the factions in the family and town, and finally comes into her own as a bold, sometimes reckless bootlegger. You will fall in love with Sallie Kincaid, a feisty and fearless, terrified and damaged young woman who refuses to be corralled.", "Winner: 2022 Hugo Award for Best Series A 2023 Indie Next Pick! A LibraryReads Hall of Fame Inductee! A young girl discovers an infinite variety of worlds in this standalone tale in the Hugo and Nebula Award-winning Wayward Children series from Seanan McGuire, Lost in the Moment and Found. Welcome to the Shop Where the Lost Things Go. If you ever lost a sock, you’ll find it here. If you ever wondered about a favorite toy from childhood... it’s probably sitting on a shelf in the back. And the headphones that you swore this time you’d keep safe? You guessed it.... Antoinette has lost her father. Metaphorically. He’s not in the Shop, and she’ll never see him again. But when Antsy finds herself lost (literally, this time), she discovers that however many doors open for her, leaving the Shop for good might not be as simple as it sounds. And stepping through those doors exacts a price. Lost in the Moment and Found tells us that childhood and innocence, once lost, can never be found. At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.", "The author of Florence Adler Swims Forever returns with a masterful work of historical fiction about an incendiary tragedy that shocked a young nation and tore apart a community in a single night—told from the perspectives of four people whose actions during the inferno changed the course of history. Richmond, Virginia 1811. It’s the height of the winter social season, the General Assembly is in session, and many of Virginia’s gentleman planters, along with their wives and children, have made the long and arduous journey to the capital in hopes of whiling away the darkest days of the year. At the city’s only theater, the Charleston-based Placide & Green Company puts on two plays a night to meet the demand of a populace that’s done looking for enlightenment at the front of a church. On the night after Christmas, the theater is packed with more than six hundred holiday revelers. In the third-floor boxes, sits newly-widowed Sally Henry Campbell, who is glad for any opportunity to relive the happy times she shared with her husband. One floor away, in the colored gallery, Cecily Patterson doesn’t give a whit about the play but is grateful for a four-hour reprieve from a life that has recently gone from bad to worse. Backstage, young stagehand Jack Gibson hopes that, if he can impress the theater’s managers, he’ll be offered a permanent job with the company. And on the other side of town, blacksmith Gilbert Hunt dreams of one day being able to bring his wife to the theater, but he’ll have to buy her freedom first. When the theater goes up in flames in the middle of the performance, Sally, Cecily, Jack, and Gilbert make a series of split-second decisions that will not only affect their own lives but those of countless others. And in the days following the fire, as news of the disaster spreads across the United States, the paths of these four people will become forever intertwined. Based on the true story of Richmond’s theater fire, The House Is on Fire offers proof that sometimes, in the midst of great tragedy, we are offered our most precious—and fleeting—chances at redemption.", "\"She craved an escape. He craved to be found.Two silent hearts thirsty, until they both drowned.\" To my beloved black sea, It was full dark when I snuck out of the castle to meet you. You wore those ripped black jeans and your new friend's boots, with sleet from the forest still in the grooves. You moved awkwardly in your new clothes because you were still creating yourself, like one of your drawings. We drank vanilla cola from glass bottles and listened to a song about how fast the night changes over and over. Two adults frolicking as youths, French kissing in secret to hide from winter and distract ourselves from the town crumbling around us. The way we touched each other was equally punishing and artful, painting a world where we could be together on each other's skin. For a while, we pretended. For a while, I was the kind of woman you could be loyal to and fight for, and you weren't the lost, forbidden Heathen. Now, it's been days since I've seen you. I've decided long ago, and this is my last letter. Everything I've worked so hard for-before you came along-will carry on as if our time together never happened. Don't bother stopping me. As I once said, the tremor between us will only lead to carnage. But as I plunge a knife into the chest of the man I once desired to marry, I'll think of all those foolish nights when we pretended, our time on Bone Island, vanilla cola, our stupid song, and you. Yes, my beloved black sea. I'll think of you. xx, a", "From J. Bree, bestselling author of The Bonds That Tie, comes an epic and enthralling new romantasy series. I devoted my life to a king who was not my own. On the road to ultimate honor and glory, I lost everything. Now, in a world ravaged by the whims of those who rule, I must turn my back on a lifetime of friendships and loyalties to face my own fate. The Savage Prince. Heir to the high-fae throne of the Southern Lands, he is known for his brutality and cold heart. But with the kingdom on the brink of ruin, I have no choice but to seek him out. The war between the fae and the witches rages, and there's no end in sight. My destiny is clear-help the prince defeat his enemies before it's too late. One small problem. I am Rookesbane Eveningstar. The Favored Child returned, a Witch of the Woods. The greatest enemy of my Fates-blessed mate. *The Crown of Oaths and Curses is a full-length MF epic fantasy romance with material that may be difficult for some readers. This book will end on a cliffhanger. It's recommended for 18+ due to language and sexual situations. Book 1 of a 3-book series.", "Was it an accident...or an attempted murder? Dr. Phyl Forster watched the TV news, horrified at the sight of the broken body in the ravine. Then she raced to the hospital to see the victim. Miraculously, the girl was alive, but without name or memory. An irresistible challenge to Dr. Phyl, the psychiatrist who had buried her own past.... Detective Franco Mahoney was looking for a killer, without a whisper of a clue. He needed the beautiful psychiatrist to unlock the victim's mind. But he wasn't prepared for the passion Dr. Phyl inspired or the passion that ensued.... Elizabeth Adler's riveting novel of erotic obsession and revenge sweeps from San Francisco to Paris, from the Côte d'Azur to a remote Hawaiian island, tracing a tale of murder and madness with roots in a decadent past....", "A NEW YORK TIMES BESTSELLER “A twisty, immersive whodunit perfect for fans of Donna Tartt’s The Secret History.” —People \"Spellbinding.\" —The New York Times Book Review \"[An] irresistible literary page-turner.\" —The Boston Globe Named a Most Anticipated Book of 2023 by TIME, NPR, USA Today, Elle, Newsweek, Salon, Bustle, AARP, The Millions, Good Housekeeping, and more The riveting new novel — \"part true-crime page-turner, part campus coming-of-age\" (San Francisco Chronicle) — from the author of the Pulitzer Prize and National Book Award finalist The Great Believers A successful film professor and podcaster, Bodie Kane is content to forget her past—the family tragedy that marred her adolescence, her four largely miserable years at a New Hampshire boarding school, and the murder of her former roommate, Thalia Keith, in the spring of their senior year. Though the circumstances surrounding Thalia’s death and the conviction of the school’s athletic trainer, Omar Evans, are hotly debated online, Bodie prefers—needs—to let sleeping dogs lie. But when the Granby School invites her back to teach a course, Bodie is inexorably drawn to the case and its increasingly apparent ﬂaws. In their rush to convict Omar, did the school and the police overlook other suspects? Is the real killer still out there? As she falls down the very rabbit hole she was so determined to avoid, Bodie begins to wonder if she wasn’t as much of an outsider at Granby as she’d thought—if, perhaps, back in 1995, she knew something that might have held the key to solving the case. In I Have Some Questions for You, award-winning author Rebecca Makkai has crafted her most irresistible novel yet: a stirring investigation into collective memory and a deeply felt examination of one woman’s reckoning with her past, with a transﬁxing mystery at its heart. Timely, hypnotic, and populated with a cast of unforgettable characters, I Have Some Questions for You is at once a compulsive page-turner and a literary triumph.", "A movie buff periodically receives tips from the spirit of Humphrey Bogart on how to make it with women.", "SHE LIVES BY HER INTUITION. HE FEEDS ON HER PLEASURE. From Jennifer L. Armentrout, the #1 New York Times bestselling author of From Blood and Ash, comes the beginning of a searing fantasy romance series for adults, Fall of Ruin and Wrath. Long ago, the world was destroyed by gods. Only nine cities were spared. Separated by vast wilderness teeming with monsters and unimaginable dangers, each city is now ruled by a guardian—royalty who feed on mortal pleasure. Born with an intuition that never fails, Calista knows her talents are of great value to the power-hungry of the world, so she lives hidden as a courtesan of the Baron of Archwood. In exchange for his protection, she grants him information. When her intuition leads her to save a traveling prince in dire trouble, the voice inside her blazes with warning—and promise. Today he’ll bring her joy. One day he'll be her doom. When the Baron takes an interest in the traveling prince and the prince takes an interest in Calista, she becomes the prince’s temporary companion. But the city simmers with rebellion, and with knights and monsters at her city gates and a hungry prince in her bed, intuition may not be enough to keep her safe. Calista must choose: follow her intuition to safety or follow her heart to her downfall. Breathtaking suspense and scorching romance meet in this immersive new fantasy from a mega-bestselling force, Jennifer L. Armentrout. At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.", "A haunting Southern Gothic from an award-winning master of suspense, A House With Good Bones explores the dark, twisted roots lurking just beneath the veneer of a perfect home and family. \"Mom seems off.\" Her brother's words echo in Sam Montgomery's ear as she turns onto the quiet North Carolina street where their mother lives alone. She brushes the thought away as she climbs the front steps. Sam's excited for this rare extended visit, and looking forward to nights with just the two of them, drinking boxed wine, watching murder mystery shows, and guessing who the killer is long before the characters figure it out. But stepping inside, she quickly realizes home isn’t what it used to be. Gone is the warm, cluttered charm her mom is known for; now the walls are painted a sterile white. Her mom jumps at the smallest noises and looks over her shoulder even when she’s the only person in the room. And when Sam steps out back to clear her head, she finds a jar of teeth hidden beneath the magazine-worthy rose bushes, and vultures are circling the garden from above. To find out what’s got her mom so frightened in her own home, Sam will go digging for the truth. But some secrets are better left buried. Also by T. Kingfisher Nettle & Bone What Moves the Dead At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.", "Two people make a wager on who can find love first, not realizing what they should be betting on is each other, in this new romantic comedy by Lynn Painter, New York Times bestselling author of Mr. Wrong Number. Hallie Piper is turning over a new leaf. After belly-crawling out of a hotel room (hello, rock bottom), she decides it’s time to become a full-on adult. She gets a new apartment, a new haircut, and a new wardrobe, but when she logs onto the dating app that she has determined will find her new love, she sees none other than Jack, the guy whose room she snuck out of. After agreeing they are absolutely not interested in each other, Jack and Hallie realize they’re each other’s perfect wing-person in their searches for The One. They text each other about their dates, often scheduling them at the same restaurant so that if things don’t go well, the two of them can get tacos afterward. Spoiler: they get a lot of tacos together. Discouraged by the lack of prospects, Jack and Hallie make a wager to see who can find true love first, but when they agree to be fake dates for a weekend wedding, all bets are off. As they pretend to be a couple, lines become blurred and they both struggle to remember why the other was a bad idea to begin with.", "When a spirited young woman with a penchant for adventure finds herself locked away in a dragon’s tower, she realizes that fate has a peculiar sense of humor when it comes to her romantic prospects, in this laugh-out-loud fantasy rom-com. All children are told fairytales. Some are epic adventures with high stakes and exciting twists, while others are tales of pitiful princesses trapped in boring towers pining for their Prince Charmings to come and rescue them. Growing up, Cherry always hated those stories. Why didn’t the princesses just get up and rescue themselves? Little did she know that her own fate would take an ironically similar turn. Because now, here she is. Stuck. In a tower. Turns out, when a dragon holds you hostage, he doesn’t just let you get up and leave. Who knew? And just when Cherry thinks she sees hope on the horizon, that hope is smashed to bits by—you guessed it—another damn dragon.", "A NEW YORK TIMES AND USA TODAY BESTSELLER #1 New York Times bestselling author Chloe Gong’s adult epic fantasy debut. Inspired by Shakespeare’s Antony and Cleopatra, Immortal Longings is a fiery collision of power plays, spilled blood, and romance amidst a set of deadly games. Every year, thousands in the kingdom of Talin will flock to its capital twin cities, San-Er, where the palace hosts a set of games. For those confident enough in their ability to jump between bodies, competitors across San-Er fight to the death to win unimaginable riches. Princess Calla Tuoleimi lurks in hiding. Five years ago, a massacre killed her parents and left the palace of Er empty…and she was the one who did it. Before King Kasa’s forces in San can catch her, she plans to finish the job and bring down the monarchy. Her reclusive uncle always greets the victor of the games, so if she wins, she gets her opportunity at last to kill him. Enter Anton Makusa, an exiled aristocrat. His childhood love has lain in a coma since they were both ousted from the palace, and he’s deep in debt trying to keep her alive. Thankfully, he’s one of the best jumpers in the kingdom, flitting from body to body at will. His last chance at saving her is entering the games and winning. Calla finds both an unexpected alliance with Anton and help from King Kasa’s adopted son, August, who wants to mend Talin’s ills. But the three of them have very different goals, even as Calla and Anton’s partnership spirals into something all-consuming. Before the games close, Calla must decide what she’s playing for—her lover or her kingdom.", "#1 New York Times bestselling author Kerri Maniscalco makes her adult debut with a \"hot\" new standalone romantic fantasy (Jennifer L. Armentrout) set in her fan-favorite Kingdom of the Wicked world, about a dark prince battling an impossible curse—and the artist who might be the only one who can set him free. Sinner. Villain. Wicked. The Prince of Envy has never claimed to be a saint. But when a cryptic note arrives, signaling the beginning of a deadly game, he knows it will take more than a hint of sin to win and save his falling demon court. Riddles, hexed objects, anonymous players, nothing will stand in his way, though none of his meticulous plans prepare him for her, the frustrating artist who ignites his sin like no other… Virtuous. Darling. Liar. The trouble with scoundrels and blackguards is that they haven’t a modicum of honor, a fact Miss Camilla Antonius learns after one desperate mistake allows Waverly Green’s most notorious rake to blackmail her. To avoid a ruinous scandal, Camilla is forced to enter a devil’s bargain with Envy, little expecting his game will awaken her true nature . . . Together, Envy and Camilla must embark on a perilous journey through the Underworld—from glittering demon courts to the sultry vampire realm and beyond—while trying to avoid the most dangerous trap of all: falling in love.", "\"Preparing you for an education you'll never forget, this introduction to The McMasters Conservatory, dedicated to the consummate execution of homicidal arts, follows students as they prepare for graduation by getting away with the perfect murder of someone whose death will make the world a much better place to live\"--", "With danger drawing ever closer, their only hope of saving their futures lies in each other. As a midwife, Catherine Remington is successful in bringing new life into the world, but she's failed one too many times in finding true love. When she's accused of a murder she didn't commit, she's forced to flee to Colorado to honor a patient's dying wish by delivering a newborn infant to his father. The repentant prodigal Dylan McQuaid is finally back in Fairplay. As sheriff, he's doing his best to prove to the town he's a changed man and worthy of their trust. When a woman shows up with an infant son he didn't know he had, Dylan is left with only complicated choices on what to do next. Having grown attached to Dylan's son, Catherine doesn't want to part ways with the infant, but what she doesn't bargain for is how easily she'll fall for the charming sheriff, or how quickly the past will catch up with her and put their love and lives in danger.", "*Now an acclaimed live-action Netflix series!* Boy meets boy. Boys become friends. Boys fall in love. The bestselling LGBTQ+ graphic novel about life, love, and everything that happens in between: this is the fifth volume of the much-loved HEARTSTOPPER series. 'Absolutely delightful. Sweet, romantic, kind. Beautifully paced. I loved this book.' RAINBOW ROWELL, author of Carry On Nick and Charlie are very much in love. They've finally said those three little words, and Charlie has almost persuaded his mum to let him sleep over at Nick's house ... But with Nick going off to university next year, is everything about to change? By Alice Oseman, winner of the YA Book Prize, Heartstopper encompasses all the small moments of Nick and Charlie's lives that together make up something larger, which speaks to all of us. Contains discussions around mental health and eating disorders, and sexual references. 'The queer graphic novel we wished we had at high school.' Gay Times", "I'm out for revenge. After careful planning, I gave the man who messed with my family a taste of his own medicine. I thought it'd end there. It didn't. Landon King is a genius artist, a posh rich boy, and my worst nightmare. He's decided that I'm the new addition to his chess game. Too bad for him, I'm no pawn. If he hits, I hit back, twice as hard and with the same hostility. He says he'll ruin me. Little does he know that ruination goes both ways.", "NATIONAL BESTSELLER “Very funny—think Bridget Jones meets ‘Broad City’. . . . Heisey is making a career out of guiding characters through the kinds of crises we can laugh at and sympathize with all at once, while upending enough rom-com tropes to keep things interesting.” – Bethanne Patrick, Los Angeles Times “One of the most hilarious and barbed accounts of unexpectedly starting over I’ve ever read. . . . If you’ve ever felt lost and hoped that it was leading towards wisdom, Really Good, Actually is your novel.” — Stephanie Danler, New York Times bestselling author of Sweetbitter Recommended by Los Angeles Times • Washington Post • GQ • Elle • Good Morning America • People • Guardian • The Times • E! News Online • The Globe and Mail • Toronto Star • The Week • New York Post • Shondaland • and many more! A hilarious and painfully relatable debut novel about one woman’s messy search for joy and meaning in the wake of an unexpected breakup, from comedian, essayist, and award-winning screenwriter Monica Heisey Maggie is fine. She’s doing really good, actually. Sure, she’s broke, her graduate thesis on something obscure is going nowhere, and her marriage only lasted 608 days, but at the ripe old age of twenty-nine, Maggie is determined to embrace her new life as a Surprisingly Young Divorcée™. Now she has time to take up nine hobbies, eat hamburgers at 4 am, and “get back out there” sex-wise. With the support of her tough-loving academic advisor, Merris; her newly divorced friend, Amy; and her group chat (naturally), Maggie barrels through her first year of single life, intermittently dating, occasionally waking up on the floor and asking herself tough questions along the way. Laugh-out-loud funny and filled with sharp observations, Really Good, Actually is a tender and bittersweet comedy that lays bare the uncertainties of modern love, friendship, and our search for that thing we like to call “happiness”. This is a remarkable debut from an unforgettable new voice in fiction. “A prime example of how a storyteller's voice can pull you right in and keep you clinging to every sentence. . . . This is a book I will give to my closest girlfriends and say, ‘You have to read this.’” — Zibby Owens, GoodMorningAmerica.com “Tremendously funny and thoughtful.” –GQ", "In this beautiful and moving novel about family, love, and growing up, Ann Patchett once again proves herself one of America's finest writers. \"Patchett leads us to a truth that feels like life rather than literature.\" --The Guardian In the spring of 2020, Lara's three daughters return to the family's orchard in Northern Michigan. While picking cherries, they beg their mother to tell them the story of Peter Duke, a famous actor with whom she shared both a stage and a romance years before at a theater company called Tom Lake. As Lara recalls the past, her daughters examine their own lives and relationship with their mother, and are forced to reconsider the world and everything they thought they knew. Tom Lake is a meditation on youthful love, married love, and the lives parents have led before their children were born. Both hopeful and elegiac, it explores what it means to be happy even when the world is falling apart. As in all of her novels, Ann Patchett combines compelling narrative artistry with piercing insights into family dynamics. The result is a rich and luminous story, told with profound intelligence and emotional subtlety, that demonstrates once again why she is one of the most revered and acclaimed literary talents working today.", "#1 NEW YORK TIMES BESTSELLER • From the author of Killers of the Flower Moon, a page-turning story of shipwreck, survival, and savagery, culminating in a court martial that reveals a shocking truth. The powerful narrative reveals the deeper meaning of the events on The Wager, showing that it was not only the captain and crew who ended up on trial, but the very idea of empire. “Riveting...Reads like a thriller, tackling a multilayered history—and imperialism—with gusto.” —Time \"A tour de force of narrative nonfiction.” —The Wall Street Journal On January 28, 1742, a ramshackle vessel of patched-together wood and cloth washed up on the coast of Brazil. Inside were thirty emaciated men, barely alive, and they had an extraordinary tale to tell. They were survivors of His Majesty’s Ship the Wager, a British vessel that had left England in 1740 on a secret mission during an imperial war with Spain. While the Wager had been chasing a Spanish treasure-filled galleon known as “the prize of all the oceans,” it had wrecked on a desolate island off the coast of Patagonia. The men, after being marooned for months and facing starvation, built the flimsy craft and sailed for more than a hundred days, traversing nearly 3,000 miles of storm-wracked seas. They were greeted as heroes. But then ... six months later, another, even more decrepit craft landed on the coast of Chile. This boat contained just three castaways, and they told a very different story. The thirty sailors who landed in Brazil were not heroes – they were mutineers. The first group responded with countercharges of their own, of a tyrannical and murderous senior officer and his henchmen. It became clear that while stranded on the island the crew had fallen into anarchy, with warring factions fighting for dominion over the barren wilderness. As accusations of treachery and murder flew, the Admiralty convened a court martial to determine who was telling the truth. The stakes were life-and-death—for whomever the court found guilty could hang. The Wager is a grand tale of human behavior at the extremes told by one of our greatest nonfiction writers. Grann’s recreation of the hidden world on a British warship rivals the work of Patrick O’Brian, his portrayal of the castaways’ desperate straits stands up to the classics of survival writing such as The Endurance, and his account of the court martial has the savvy of a Scott Turow thriller. As always with Grann’s work, the incredible twists of the narrative hold the reader spellbound.", "A perfectly wicked debut thriller about an ambitious woman who, after a lifetime of conning alongside her mother, wants to leave her dark past behind and marry the heir to one of the country's wealthiest families. Like any enterprising woman, Bea knows what she’s worth and is determined to get all she deserves—it just so happens that what she deserves is to marry rich. Filthy rich. After years of forced instruction by her mother in the art of swindling men, a now-solo Bea wants nothing more than to close and lock the door on their sordid partnership so she can disappear safely into old-money domesticity, sealing the final phase of her escape. When Bea chooses her ultimate target in the fully loaded, thoroughly dull and blue-blooded Collin Case, she’s ready to deploy all of her tricks one last time. The challenge isn’t getting the ring, but rather the approval of Collin’s family and everyone else in their 1 percent tax bracket, particularly his childhood best friend, Gale Wallace-Leicester. Going toe-to-toe with Gale isn’t a threat to an expert like Bea, but what begins as an amusing cat-and-mouse game quickly develops into a dangerous pursuit of the grisly truth. Finding herself at a literal life-and-death crossroads with everything on the line, Bea must finally decide who she really wants to be. Like mother, like daughter?", "\"Open Throat is what fiction should be.\" —The New York Times Book Review One of ELLE's Best Summer Books of 2023, and one of i-D's Fiction to be Excited for in 2023. Named a Most Anticipated Book by The New York Times, Vanity Fair, Buzzfeed, Boston Globe, Nylon, Alta, Shondaland, Chicago Review of Books, Philadelphia Inquirer, and Literary Hub A lonely, lovable, queer mountain lion narrates this star-making fever dream of a novel. A queer and dangerously hungry mountain lion lives in the drought-devastated land under the Hollywood sign. Lonely and fascinated by humanity’s foibles, the lion spends their days protecting a nearby homeless encampment, observing hikers complain about their trauma, and, in quiet moments, grappling with the complexities of their gender identity, memories of a vicious father, and the indignities of sentience. When a man-made fire engulfs the encampment, the lion is forced from the hills down into the city the hikers call “ellay.” As the lion confronts a carousel of temptations and threats, they take us on a tour that spans the cruel inequalities of Los Angeles and the toll of climate grief. But even when salvation finally seems within reach, they are forced to face down the ultimate question: Do they want to eat a person, or become one? Henry Hoke’s Open Throat is a marvel of storytelling, a universal journey through a wondrous and menacing world recounted by a lovable mountain lion. Feral and vulnerable, profound and playful, Open Throat is a star-making novel that brings the mythic to life.", "From the #1 Kickstarter campaign of all time—#1 New York Times bestselling author Brandon Sanderson adds to his Cosmere universe shared by Mistborn and The Stormlight Archive with a new standalone novel especially for fans of fantasy romances. Illustrated by Aliya Chen. There is a world. One of endless night, surrounded by an even deeper darkness. Filled with nightmares come to life, twisted shapes that slink to windows and ease open doors, sliding across floors to look down on helpless faces. There is another world. A bright world, so bright it burns. Filled with stacked stones that call forth miracles, raised by callused hands that tremble in their work, drained with each stone lifted, settled, lifted again. Between these worlds two souls connect. Collide. Entwine. A bridge. A path. A road to both worlds changing forever. Yumi has spent her entire life in strict obedience, granting her the power to summon the spirits that bestow vital aid upon her society—but she longs for even a single day as a normal person. Painter patrols the dark streets dreaming of being a hero—a goal that has led to nothing but heartache and isolation, leaving him always on the outside looking in. In their own ways, both of them face the world alone. Suddenly flung together, Yumi and Painter must strive to right the wrongs in both their lives, reconciling their past and present while maintaining the precarious balance of each of their worlds. If they cannot unravel the mystery of what brought them together before it’s too late, they risk forever losing not only the bond growing between them, but the very worlds they’ve always struggled to protect. Note from Brandon: Even for a compulsive planner like me, sometimes a story emerges like magic. Unexpected, unprompted. You build an outline in days, craft worlds during a compulsive daydream, and develop characters with a burst of imagination like the brief flash of a firework. That was Yumi and the Nightmare Painter for me. The unanticipated story of two people who find one another. May your dreams live as mine sometimes do.", "Witness what the gods do after dark in the fourth volume of a stylish and contemporary reimagining of one of the best-known stories in Greek mythology, featuring exclusive behind-the-scenes content from creator Rachel Smythe “I don’t always get to do as I please.” The rumor mill of Olympus is constantly churning, but Persephone and Hades are all anyone can talk about. With the constant gossip creating intense pressure on the pair, they decide to slow down their budding romance and focus on sorting out their own issues first. But that’s easier said than done. Hades struggles to find support in his personal life, with Zeus trivializing his feelings and Minthe resorting to abusive patterns in their relationship. And while Hades tries to create healthier boundaries where he can—like finally putting a stop to his sporadic, revenge-fueled hookups with Hera—he still feels lonely and adrift. Persephone feels equally ostracized as her classmates shun her for her connection to Hades, and she can find no refuge at home, with Apollo constantly dropping by unannounced and pushing his unwelcome advances. And on top of it all, the wrathful god of war, Ares, has returned to Olympus to dredge up his sordid history with the goddess of spring, threatening to surface Persephone’s dark and mysterious past and ruin her tenuous position in the land of the gods. Despite agreeing to take it slow, Persephone and Hades find themselves inextricably drawn toward each other once more amid the chaos. The pull of fate cannot be denied. This edition of Rachel Smythe’s original Eisner-nominated webcomic Lore Olympus features exclusive behind-the-scenes content and brings the Greek pantheon into the modern age in a sharply perceptive and romantic graphic novel. This volume collects episodes 76–102 of the #1 WEBTOON comic Lore Olympus.", "NEW YORK TIMES BESTSELLER • From the bestselling author of the Brown Sisters trilogy, comes a laugh-out-loud story about a quirky content creator and a clean-cut athlete testing their abilities to survive the great outdoors—and each other. Bradley Graeme is pretty much perfect. He’s a star football player, manages his OCD well (enough), and comes out on top in all his classes . . . except the ones he shares with his ex-best friend, Celine. Celine Bangura is conspiracy-theory-obsessed. Social media followers eat up her takes on everything from UFOs to holiday overconsumption—yet, she’s still not cool enough for the popular kids’ table. Which is why Brad abandoned her for the in-crowd years ago. (At least, that’s how Celine sees it.) These days, there’s nothing between them other than petty insults and academic rivalry. So when Celine signs up for a survival course in the woods, she’s surprised to find Brad right beside her. Forced to work as a team for the chance to win a grand prize, these two teens must trudge through not just mud and dirt but their messy past. And as this adventure brings them closer together, they begin to remember the good bits of their history. But has too much time passed . . . or just enough to spark a whole new kind of relationship?", "“This delicious combination of Clue and The Great British Bake Off kept me turning the pages all night!” —Janet Evanovich, #1 New York Times bestselling author Only Murders in the Building meets The Maid in this darkly beguiling locked-room mystery where someone turns up dead on the set of TV’s hottest baking competition—perfect for fans of Nita Prose, Richard Osman, and Anthony Horowitz. Every summer for the past ten years, six awe-struck bakers have descended on the grounds of Grafton, the leafy and imposing Vermont estate that is not only the filming site for “Bake Week” but also the childhood home of the show’s famous host, celebrated baker Betsy Martin. The author of numerous bestselling cookbooks and hailed as “America’s Grandmother,” Betsy Martin isn’t as warm off-screen as on, though no one needs to know that but her. She has always demanded perfection, and gotten it with a smile, but this year something is off. As the baking competition commences, things begin to go awry. At first, it’s merely sabotage—sugar replaced with salt, a burner turned to high—but when a body is discovered, everyone is a suspect. A sharp and suspenseful thriller for mystery buffs and avid bakers alike, The Golden Spoon is a brilliant puzzle filled with shocking twists and turns that will keep you reading late into the night until you turn the very last page of this incredible debut.", "\"A riotous adventure through the ages of Greek mythology, populated by a cast of vivid, glittering characters. Luna McNamara strikes the perfect note of irreverent humor and furious emotion in this fabulous novel. An absolute joy!\" — JENNIFER SAINT, bestselling author of Ariadne and Elektra The god of desire is cursed to fall for a spirited young mortal woman, but if she looks upon his face they will be parted forever in this utterly transporting reimagining of Greek mythology—an epic adventure and love story for the ages, sure to satisfy fans of Madeline Miller and V.E. Schwab Who said true love is a myth? A prophecy claims that Psyche, princess of Mycenae, will defeat a monster feared even by the gods. Rebelling against her society’s expectations for women, Psyche spends her youth mastering blade and bow, preparing to meet her destiny. When Psyche angers the love goddess Aphrodite, she sends Eros, god of desire, to deliver a cruel curse. After eons watching humanity twist his gifts, the last thing Eros wants is to become involved in the chaos of the mortal world. But when he pricks himself with the arrow intended for Psyche, Eros finds himself doomed to yearn for a woman who will be torn from him the moment their eyes meet. Thrown together by fate, headstrong Psyche and world-weary Eros will face challenges greater than they could have ever imagined. And as the Trojan War begins and divine powers try to keep them apart, the pair must determine if the curse could become something more . . . before it’s too late. A joyous and subversive tale of gods, monsters, and the human heart and soul, Psyche and Eros dazzles the senses while exploring notions of trust, sacrifice, and what it truly means to be a hero. With unforgettably vivid characters, spellbinding prose, and delicious tension, Luna McNamara has crafted a shimmering and propulsive debut novel about a love so strong it defies the will of Olympus. \"An enthralling tale of adventure, romance, and star-crossed lovers.” — SUE LYNN TAN, bestselling author of Daughter of the Moon Goddess \"Startlingly lovely. This is Greek mythology as it's meant to be told—witty, indulgent, deeply felt.\" — GRACE D. LI, New York Times bestselling author of Portrait of a Thief \"Every page is a breathless, swoonworthy adventure.\" — ROSHANI CHOKSHI, New York Times bestselling author of The Last Tale of the Flower Bride", "In this lush, romantic epic fantasy series from a New York Times bestselling author, a young woman’s secret power to raise the dead plunges her into the dangerous and glamorous world of the Sainted King’s royal court. When Lore was thirteen, she escaped a cult in the catacombs beneath the city of Dellaire. And in the ten years since, she’s lived by one rule: don’t let them find you. Easier said than done, when her death magic ties her to the city. Mortem, the magic born from death, is a high-priced and illicit commodity in Dellaire, and Lore’s job running poisons keeps her in food, shelter, and relative security. But when a run goes wrong and Lore’s power is revealed, she’s taken by the Presque Mort, a group of warrior-monks sanctioned to use Mortem working for the Sainted King. Lore fully expects a pyre, but King August has a different plan. Entire villages on the outskirts of the country have been dying overnight, seemingly at random. Lore can either use her magic to find out what’s happening and who in the King’s court is responsible, or die. Lore is thrust into the Sainted King’s glittering court, where no one can be believed and even fewer can be trusted. Guarded by Gabriel, a duke-turned-monk, and continually running up against Bastian, August’s ne'er-do-well heir, Lore tangles in politics, religion, and forbidden romance as she attempts to navigate a debauched and opulent society. But the life she left behind in the catacombs is catching up with her. And even as Lore makes her way through the Sainted court above, they might be drawing closer than she thinks.", [], "“One of those singular books that pulls readers into a completely immersive world with a dazzling story and characters so deftly drawn that you can’t help but ache for them.”–New York Times bestselling author Lisa Maxwell I know the stories they will tell. I’ve heard the echoes of their songs—songs that will outlive us all. But this song is not theirs. It is mine. Behind the timeless tale you know is the captivating story you never heard: a sweeping epic in which Troy’s strong, yet misunderstood women take center stage in the most famous war in history. Andromache is cast as the doting wife of Prince Hector, yet her Amazon warrior name means “battler of men.” The only one with the cunning to outwit the invading Greeks, she must gather a band of outcasts and become the military commander she was born to be before the life she and Hector have built is reduced to ashes. Rhea is a war refugee and a horse whisperer who finally earns a place and sense of belonging in Hector’s stables. To save her new home, she must become an unlikely spy and face down a forbidden love that will test all her loyalties. Helen is blamed by all for starting the Trojan War, but no one knows her real story. To escape her tormentor and foil a plot to undermine Hector, Helen must risk everything by revealing her true face to the one who despises her most. Set in the wider landscape of the late Bronze Age collapse, this realistic and immersive Troy is a perilous battleground for warriors and politicians alike, not a playground where the fate of men and women make sport for gods and goddesses. It’s a harrowing novel of palace intrigue, the transcendent bond of female friendship, and the everyday bravery of invisible heroes in times of war. The women of Troy are threads spinning on a single loom. Can they reweave the tapestry of fate?", "When Lucy planned a summer trip to Florence, she didn’t expect to have to go single. Or for the hotel manager to cheat her out of her river-view room. And especially not for a broody, handsome stranger to offer to swap rooms with her. Offer is a euphemism. The mysterious George Emerson sort of brutalizes her into accepting the exchange. His gesture is as kind as the tone in which he poses it is barbaric, leaving Lucy rightfully confused. What is it about this man that makes her heart race while simultaneously making her want to punch him in the face? Only an unforgettable vacation under the Tuscan sun will unravel Lucy’s true feelings. An enemies to lovers, grumpy sunshine rom-com.", "England, 1820 Rosalind Newbury is counting down the days until her wedding to the Duke of Marlow, a man she has only met twice. The marriage is more an agreement between two families and less a romantic connection between two hearts, but Rosalind becoming a duchess will elevate her family's status to dizzying heights. And the duke is a kind man who will care for Rosalind, even if he doesn't love her. She only has three weeks before her life changes forever, and she knows exactly how she wants to spend her days. As a child, Ros was inspired by her adventurous Aunt Alice and created a list of ten things to do before her wedding day. So far, Ros has done none of them. She is determined to tackle each item, though she'll have to accomplish them all in secret. After all, a soon-to-be-duchess is not usually allowed to bury treasure in the pasture, eat sweets all day, or learn how to swim. She enlists the help of her best friend, Liza, who brings along her cousin, Charlie, a prodigal son-turned-boxer who has come to the countryside to mend his reputation and learn how to be his father's heir. Together, the three of them work to complete the list, and as each item is crossed off, an unlikely friendship blossoms between Ros and Charlie. The more time they spend together, the more Ros falls in love with this imperfect man and his good heart. With the wedding looming, Ros must decide to either admit her romantic feelings for Charlie and risk her family's future, or keep her promise to marry the duke and start a new life as a noblewoman.", "Three ordinary people risk everything for a chance at redemption in this audacious, utterly gripping novel of catastrophe and survival at the end of the world, from the acclaimed author of The Chalk Man. An overturned bus full of students. All of them are trapped. A stranded cable car full of strangers. One of them is dead. An isolated chalet full of friends. Soon they'll be enemies. Outside, a snowstorm rages. Inside each group, a killer lurks. But that's not their only problem. Why is no rescue coming? What are they trying to escape from? And who are the terrifying Whistlers? A locked-room mystery. A dystopian thriller. A nail-shredding horror. One terrifying conclusion . . .", "An Instant New York Times Bestseller! An Instant Indies Bestseller! A scrappy former maid and jewel thief must outwit gods, injustice, and her own past in this sequel to the Indie Next Pick, Little Thieves by Margaret Owen. Let's get one thing straight - Vanja Schmidt wasn't trying to start a cult. After taking down a corrupt margrave, breaking a deadly curse, and finding romance with the vexingly scrupulous junior prefect Emeric Conrad, Vanja had one great mystery left: her long-lost birth family . . . and whether they would welcome a thief. But in her search for an honest trade, she hit trouble and invented a god, the Scarlet Maiden, to scam her way out. Now that lie is growing out of control—especially when Emeric arrives to investigate and the Scarlet Maiden manifests to claim him as a virgin sacrifice. For his final test to become a prefect, Emeric must determine if Vanja is guilty of serious fraud or if the Scarlet Maiden—and her claim to him—is genuine. Meanwhile, Vanja is chasing an alternative sacrifice that could be their way out. The hunt leads her not only into the lairs of monsters and the paths of gods, but also the ties of her past. And with what should be the simplest way to save Emeric hanging over their heads, he and Vanja must face a more dangerous question: Is there a future for a thief and a prefect, and at what price? From the indie bestselling author Margaret Owen comes the thrilling next installment in the Little Thieves trilogy with all new interior illustrations from the author.", "Two outcasts find themselves caught in a web of forbidden love, dangerous magic, and dark secrets that could change the world forever in the start of a riveting epic fantasy series from the #1 New York Times bestselling author of The Shadowhunter Chronicles. “Everything I look for in fantasy.”—George R. R. Martin In the vibrant city-state of Castellane, the richest of nobles and the most debauched of criminals have one thing in common: the constant search for wealth, power, and the next hedonistic thrill. Kel is an orphan, stolen from the life he knew to become the Sword Catcher—the body double of a royal heir, Prince Conor Aurelian. He has been raised alongside the prince, trained in every aspect of combat and statecraft. He and Conor are as close as brothers, but Kel knows that his destiny is to die for Conor. No other future is possible. Lin Caster is one of the Ashkar, a small community whose members still possess magical abilities. By law, they must live behind walls within the city, but Lin, a physician, ventures out to tend to the sick and dying of Castellane. Despite her skills, she cannot heal her best friend without access to forbidden knowledge. After a failed assassination attempt brings Lin and Kel together, they are drawn into the web of the mysterious Ragpicker King, the criminal ruler of Castellane’s underworld. He offers them each what they want most; but as they descend into his world of intrigue and shadow, they discover a conspiracy of corruption that reaches from the darkest gutters of Castellane to the highest tower of its palaces. As long-kept secrets begin to unravel, they must ask themselves: Is knowledge worth the price of betrayal? Can forbidden love bring down a kingdom? And will their discoveries plunge their nation into war—and the world into chaos?", "If there had been no cover-up of Robert Kennedy’s complicity in the murder of Marilyn Monroe in 1962 and he had been prosecuted based on compelling evidence at the time, the assassination of JFK by Bobby’s enemies would not have happened—changing the course of history and preventing the murder of media icon Dorothy Kilgallen. In a breakthrough book that is sure to be relevant for years to come, bestselling author (The Reporter Who Knew Too Much) and distinguished historian Mark Shaw investigates the connection between the mysterious deaths of motion picture screen siren Marilyn Monroe, President John F. Kennedy, and What’s My Line? TV star and crack investigative reporter Dorothy Kilgallen. A former noted criminal defense attorney and network legal analyst, Shaw provides an illuminating perspective as to how Robert Kennedy’s abuse of power during the early 1960s resulted in the murders of Marilyn, JFK, and Dorothy. Praise for Mark Shaw Books The Reporter Who Knew Too Much “The compelling story of Dorothy Kilgallen, the celebrated journalist once called ‘the most powerful female voice in America.’” —Nick Pileggi, author of Wiseguy and Casino Denial of Justice “A worthy sequel to the mysterious whodunit that snuffed out the brave reporter, Denial of Justice is a true crime thriller that seeks to undo the label attached to Ms. Kilgallen’s untimely demise. Mark Shaw has done an admirable and exemplary job in his work. Do not miss!” —San Francisco Book Review", "A reckless Victorian heiress sets her sights on a dashing ex-naval lieutenant, determined to win his heart as the two of them embark on a quest to solve a decades-old mystery in USA Today bestselling author Mimi Matthews’s sequel to her critically acclaimed novels The Work of Art and Gentleman Jim. Lieutenant Charles Heywood has had his fill of adventure. Battle-weary and disillusioned, he returns to England, resolved to settle down to a quiet, uneventful life on an estate of his own. But arranging to purchase the property he desires is more difficult than Charles ever imagined. The place is mired in secrets, some of which may prove deadly. If he’s going to unravel them, he’ll need the assistance of someone as daring as he is. At only twenty, Lady Katherine Beresford has already earned a scandalous reputation. As skilled with pistols as she is on horseback, she’s never met an obstacle she can’t surmount—or a man she can’t win. That is, until she encounters the infuriatingly somber Lieutenant Heywood. But Kate refuses to be deterred by the raven-haired soldier’s strong, silent facade. After all, faint heart never won handsome gentleman. From the wilds of rural Somersetshire to the glittering ballrooms of early-Victorian London, Charles and Kate embark on a cross-country quest to solve a decades’ old mystery. Will the greatest danger be to their hearts—or to their lives?", "Longlisted for the Center for Fiction First Novel Prize A Phenomenal Book Club Pick “A great and engrossing read, Kashana humanizes a way of life that is often made fun of and makes the reader understand why someone would go to such great lengths to prepare for the future, so much so she almost sold me on those Life Preserver soy bars!” —Trevor Noah A single Black lawyer puts her career and personal moral code at risk when she moves in with her coffee entrepreneur boyfriend and his doomsday-prepping roommates in a novel that's packed with tension, curiosity, humor, and wit from a writer with serious comedy credentials In the wake of her parents’ death, Aretha, a habitually single Black lawyer, has had only one obsession in life—success—until she falls for Aaron, a coffee entrepreneur. Moving into his Brooklyn brownstone to live along with his Hurricane Sandy-traumatized, illegal-gun-stockpiling, optimized-soy-protein-eating, bunker-building roommates, Aretha finds that her dreams of making partner are slipping away, replaced by an underground world, one of selling guns and training for a doomsday that’s maybe just around the corner. For readers of Victor LaValle’s The Changeling, Paul Beatty’s The Sellout, and Zakiya Harris’s The Other Black Girl, The Survivalists is a darkly humorous novel from a smart and relevant new literary voice that's packed with tension, curiosity and wit, and unafraid to ask the questions most relevant to a new generation of Americans: Does it make sense to climb the corporate ladder? What exactly are the politics of gun ownership? And in a world where it’s nearly impossible for young people to earn enough money to afford stable housing, what does it take in order to survive?", "From New York Times bestselling author Amy Harmon comes the saga of a young woman who dares to chart her own destiny in life and love during the American Revolutionary War. In 1760, Deborah Samson is born to Puritan parents in Plympton, Massachusetts. When her father abandons the family and her mother is unable to support them, Deborah is bound out as an indentured servant. From that moment on, she yearns for a life of liberation and adventure. Twenty years later, as the American colonies begin to buckle in their battle for independence, Deborah, impassioned by the cause, disguises herself as a soldier and enlists in the Continental Army. Her impressive height and lanky build make her transformation a convincing one, and it isn't long before she finds herself confronting the horrors of war head-on. But as Deborah fights for her country's freedom, she must contend with the secret of who she is--and, ultimately, a surprising love she can't deny.", "\"When a woman stumbles across a mysterious children's book, long-held secrets about her missing sister and their childhood spent in the English countryside during World War II are revealed\"--", "\"I entered into a bargain—choosing my mate over my freedom. But I underestimated the crowned prince who took me. His touch like venom. His vengeance lethal. He craves a power I no longer hold, and he’ll sacrifice every part of me until he gets it. But I don’t belong to him. I belong to his brother. His brother who will come for me, consequences be damned. My fate is entangled between two princes—one who craves my power, the other who covets me—and I have more to lose than I ever imagined. War rages in a game between queens, and I have become their pawn. But I will fight for my life, for my mate, and he will raze kingdoms to get me back.\" -- Amazon.com", "A young Jay Gatsby finds himself working as a foreign spy in this historical thriller set at the beginning of World War I. The unexpected appearance of a woman from his past, famed journalist Ella Kaye, soon complicates his mission. Racing through war-torn Europe, entangled in a dangerous web of lies, they struggle to maintain the secrets that will keep them each alive."]